// NLS_CHARSET=UTF-8
{
  "language": "es",
  "messages": [
    {
      "id": "Unable to read policy file {Arg_1} for service {Arg_2}, error: {Arg_3}",
      "translation": "No se ha podido leer el archivo de política {Arg_1} para el servicio {Arg_2}, error: {Arg_3}"
    },
    {
      "id": "Start policy advertising with the Exchange for service {Arg_1}/{Arg_2}.",
      "translation": "Iniciar la publicidad de políticas con Exchange para el servicio {Arg_1}/{Arg_2}."
    },
    {
      "id": "Unable to advertise policies with Exchange for service {Arg_1}/{Arg_2}, error: {Arg_3}",
      "translation": "No se han podido publicitar las políticas con Exchange para este servicio {Arg_1}/{Arg_2}, error: {Arg_3}"
    },
    {
      "id": "Complete policy advertising with the Exchange for service {Arg_1}/{Arg_2}.",
      "translation": "Completar la publicidad de políticas con Exchange para el servicio {Arg_1}/{Arg_2}."
    },
    {
      "id": "unable to read node policy from the local database. {Arg_1}",
      "translation": "No se ha podido leer la política de nodo de la base de datos local. {Arg_1}"
    },
    {
      "id": "Unable to read node object from the local database. {Arg_1}",
      "translation": "No se ha podido leer el objeto de nodo de la base de datos local. {Arg_1}"
    },
    {
      "id": "Unable to sync the local node policy with the Exchange copy. Error: {Arg_1}",
      "translation": "No se ha podido sincronizar la política de nodo local con la copia de Exchange. Error: {Arg_1}"
    },
    {
      "id": "Node policy updated with the Exchange copy: {Arg_1}",
      "translation": "Se ha actualizado la política de nodo con la copia de Exchange: {Arg_1}"
    },
    {
      "id": "Unable to sync the local node user input with the Exchange copy. Error: {Arg_1}",
      "translation": "No se ha podido sincronizar la entrada de usuario de nodo local con la copia de Exchange. Error: {Arg_1}"
    },
    {
      "id": "Node user input updated with the Exchange copy. The changed user inputs are: {Arg_1}",
      "translation": "La entrada de usuario de nodo se ha actualizado con la copia de Exchange. Las entradas de usuario cambiadas son: {Arg_1}"
    },
    {
      "id": "Node could not verify the agreement {Arg_1} with the consumer. Will cancel it",
      "translation": "El nodo no ha podido verificar el acuerdo {Arg_1} con el consumidor. Lo cancelará"
    },
    {
      "id": "Node is offline. Logging of periodic offline error messages will be curtailed until connection is restored",
      "translation": "El nodo está fuera de línea. El registro de los mensajes de error fuera de línea periódicos se recortará hasta que se restaure la conexión"
    },
    {
      "id": "Unable to sync the node with the Exchange copy. Error: {Arg_1}",
      "translation": "No se ha podido sincronizar el nodo con la copia de Exchange. Error: {Arg_1}"
    },
    {
      "id": "Unable to retrieve the service configuration state for node resource {Arg_1} from the Exchange, error {Arg_2}",
      "translation": "No se ha podido recuperar el estado de configuración de servicio para el recurso de nodo {Arg_1} de Exchange, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve the saved node exchange pattern from the local database. {Arg_1}",
      "translation": "No se ha podido recuperar el patrón de Exchange de nodo de la base de datos local. {Arg_1}"
    },
    {
      "id": "Unable to save the new node exchange pattern {Arg_1} to the local database. Error: {Arg_2}",
      "translation": "No se ha podido guardar el patrón de Exchange de nodo nuevo {Arg_1} en la base de datos local. Error: {Arg_2}"
    },
    {
      "id": "anax terminating, unable to sync up containers.",
      "translation": "anax está finalizando, no se puede sincronizar contenedores."
    },
    {
      "id": "anax terminating, unable to complete agreement sync up. {Arg_1}",
      "translation": "anax está finalizando, no se puede completar la sincronización del acuerdo. {Arg_1}"
    },
    {
      "id": "No input found.",
      "translation": "No se ha encontrado ninguna entrada."
    },
    {
      "id": "Unauthorized. No exchange user id is supplied.",
      "translation": "No tiene autorización. No se proporciona ningún ID de usuario de Exchange."
    },
    {
      "id": "Failed to authenticate the user with the Exchange. {Err}",
      "translation": "No se ha podido autenticar el usuario con Exchange. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to JSON object. {Err}",
      "translation": "El cuerpo de entrada no se ha podido deserializar en un objeto JSON. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to PolicyCheck object. {Err}",
      "translation": "El cuerpo de entrada no se ha podido deserializar en un objeto PolicyCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to UserInputCheck object. {Err}",
      "translation": "El cuerpo de entrada no se ha podido deserializar en un objeto UserInputCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to SecretBindingCheck object. {Err}",
      "translation": "El cuerpo de entrada no se ha podido deserializar en el objeto SecretBindingCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to CompCheck object. {Err}",
      "translation": "El cuerpo de entrada no se ha podido deserializar en un objeto CompCheck. {Err}"
    },
    {
      "id": "No exchange user id is supplied.",
      "translation": "No se proporciona ningún ID de usuario de Exchange."
    },
    {
      "id": "No exchange user organization id is supplied.",
      "translation": "No se proporciona ningún ID de organización de usuario de Exchange."
    },
    {
      "id": "No exchange user password or api key is supplied.",
      "translation": "No se proporciona ninguna clave de API ni ninguna contraseña de usuario de Exchange."
    },
    {
      "id": "Wrong organization id, user id or password.",
      "translation": "ID de organización, ID de usuario o contraseña no válidos."
    },
    {
      "id": "Exchange user {Key} is not in the correct format, should be org/username.",
      "translation": "El usuario de Exchange {Key} no tiene el formato correcto, debe ser org/username."
    },
    {
      "id": "Internal server error",
      "translation": "Error interno del servidor"
    },
    {
      "id": "There is no secrets provider configured, secrets are unavailable.",
      "translation": "No hay ningún proveedor de secretos configurado, los secretos no están disponibles."
    },
    {
      "id": "The secrets provider is not ready. The caller should retry this API call a small number of times with a short delay between calls to ensure that the secrets provider is unavailable.",
      "translation": "El proveedor de secretos no está listo. El emisor de la llamada debe reintentar esta llamada de API unas pocas veces con un breve retardo entre llamadas para asegurarse de que el proveedor de secretos no está disponible."
    },
    {
      "id": "Secret name must be provided",
      "translation": "Debe proporcionarse el nombre del secreto"
    },
    {
      "id": "Unable to read request body, error: {Err}.",
      "translation": "No se puede leer el cuerpo de la solicitud, error: {Err}."
    },
    {
      "id": "Request body is empty.",
      "translation": "El cuerpo de la solicitud está vacío."
    },
    {
      "id": "Request body parse error, {Uerr}",
      "translation": "Error de análisis del cuerpo de solicitud, {Uerr}"
    },
    {
      "id": "Permission denied, user \"{ExUser}\" cannot {Action} secrets in organization \"{Org}\"",
      "translation": "Permiso denegado, el usuario \"{ExUser}\" no puede {Action} secretos en la organización \"{Org}\""
    },
    {
      "id": "Permission denied, user \"{ExUser}\" cannot {Action} secret \"{SecretName}\" in organization \"{Org}\"",
      "translation": "Permiso denegado, el usuario \"{ExUser}\" no puede {Action} secreto \"{SecretName}\" en la organización \"{Org}\""
    },
    {
      "id": "Unable to read the vault response: {Error}",
      "translation": "No se puede leer la respuesta de la caja fuerte: {Error}"
    },
    {
      "id": "Unable to parse the vault response \"{Response}\": {Error}",
      "translation": "No se puede analizar la respuesta de la caja fuerte \"{Response}\": {Error}"
    },
    {
      "id": "Unable to {Action} secrets in organization \"{Org}\", operation not supported by the secrets provider.",
      "translation": "No se pueden {Action} secretos en la organización \"{Org}\", operación no soportada por el proveedor de secretos."
    },
    {
      "id": "Unable to {Action} secret \"{SecretName}\" in organization \"{Org}\", operation not supported by the secrets provider.",
      "translation": "No se puede {Action} el secreto \"{SecretName}\" en la organización \"{Org}\", operación no soportada por el proveedor de secretos."
    },
    {
      "id": "Secrets provider received a bad request, please check all the provided inputs.",
      "translation": "El proveedor de secretos ha recibido una solicitud errónea, compruebe todas las entradas proporcionadas."
    },
    {
      "id": "Response: {Response}",
      "translation": "Respuesta: {Response}"
    },
    {
      "id": "No secret(s) found in organization \"{Org}\"",
      "translation": "No se ha encontrado ningún secreto en la organización \"{Org}\""
    },
    {
      "id": "No secret(s) found under secret name \"{SecretName}\"",
      "translation": "No se han encontrado secretos bajo el nombre del secreto \" {SecretName}\""
    },
    {
      "id": "An unknown error occurred. Response code {ResponseCode} received from the secrets provider.",
      "translation": "Se ha producido un error desconocido. Código de respuesta {ResponseCode} recibido del proveedor de secretos."
    },
    {
      "id": "Organization must be specified in the API path",
      "translation": "La organización debe especificarse en la vía de acceso de API"
    },
    {
      "id": "User must be specified in the API path",
      "translation": "El usuario debe especificarse en la vía de acceso de API"
    },
    {
      "id": "Error checking secret {FullSecretName} in the secret manager.",
      "translation": "Error al comprobar el secreto {FullSecretName} en el gestor de secretos."
    },
    {
      "id": "Wrong type returned checking the secret name in the secret manager: {Payload}",
      "translation": "Se ha devuelto un tipo incorrecto al comprobar el nombre del secreto en el gestor del secreto: {Payload}"
    },
    {
      "id": "Secret {FullSecretName} does not exist in the secret manager.",
      "translation": "El secreto  {FullSecretName} no existe en el gestor de secretos."
    },
    {
      "id": "Error parsing the selections {Form}. {Err}",
      "translation": "Se ha producido un error al analizar las selecciones {Form}. {Err}"
    },
    {
      "id": "Error getting {Resource} for output, error {Err}",
      "translation": "Se ha producido un error al obtener {Resource} para la salida, error {Err}"
    },
    {
      "id": "Error parsing input for node configuration/registration. Input body couldn't be deserialized to node object: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para la configuración/el registro del nodo. El cuerpo de entrada no se ha podido deserializar en el objeto de nodo {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node configuration/registration. Input body couldn't be deserialized to configstate object: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para la configuración/el registro del nodo. El cuerpo de entrada no se ha podido deserializar en el objeto configstate {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node update. Input body couldn't be deserialized to node object: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para la actualización de nodo. El cuerpo de entrada no se ha podido deserializar en el objeto de nodo {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy. Input body could not be deserialized as a policy object: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para la política de nodo. El cuerpo de entrada no se ha podido deserializar como un objeto de política {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy patch. Input body could not be deserialized into a Constraint Expression or Property List: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para el parche de política de nodo. El cuerpo de entrada no se ha podido deserializar en una expresión de restricción o una lista de propiedades: {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy patch. Input body did not contain a Constraint Expression or Property List: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para el parche de política de nodo. El cuerpo de entrada no contenía una expresión de restricción o la lista de propiedades: {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error parsing input for node user input. Input body could not be deserialized as a UserInput object: {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al analizar la entrada para la entrada de usuario de nodo. El cuerpo de entrada no se ha podido deserializar como un objeto UserInput: {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error in node configuration/registration for node {Arg_1}. {Arg_2}",
      "translation": "Error en la configuración de nodo/registro para el nodo {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error in updating node {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error en la actualización de nodo {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error in node unregistration. {Arg_1}",
      "translation": "Se ha producido un error en la eliminación del registro de nodo. {Arg_1}"
    },
    {
      "id": "Error verifiying exchange version. error: {Arg_1}",
      "translation": "Se ha producido un error al verificar la versión de Exchange. error: {Arg_1}"
    },
    {
      "id": "Error in creating or replacing node policy. {Arg_1}",
      "translation": "Se ha producido un error al crear o sustituir la política de nodo. {Arg_1}"
    },
    {
      "id": "Error in patching node policy. {Arg_1}",
      "translation": "Se ha producido un error en la aplicación de parche de la política de nodo. {Arg_1}"
    },
    {
      "id": "Error in deleting node policy. {Arg_1}",
      "translation": "Se ha producido un error en la supresión de la política de nodo. {Arg_1}"
    },
    {
      "id": "Error in updating node user input. {Arg_1}",
      "translation": "Se ha producido un error en la actualización de entrada de usuario de nodo. {Arg_1}"
    },
    {
      "id": "Error in patching node user input. {Arg_1}",
      "translation": "Se ha producido un error en la aplicación de parche de entrada de usuario de nodo. {Arg_1}"
    },
    {
      "id": "Error in deleting node userinput. {Arg_1}",
      "translation": "Se ha producido un error en la supresión de la entrada de usuario de nodo. {Arg_1}"
    },
    {
      "id": "Start node configuration/registration for node {Arg_1}.",
      "translation": "Iniciar configuración/registro de nodo para nodo {Arg_1}."
    },
    {
      "id": "Start updating node {Arg_1}.",
      "translation": "Iniciar actualización de nodo {Arg_1}."
    },
    {
      "id": "Complete node update for {Arg_1}.",
      "translation": "Completar actualización de nodo para {Arg_1}."
    },
    {
      "id": "Start node unregistration.",
      "translation": "Iniciar eliminación de registro de nodo."
    },
    {
      "id": "Node unregistration complete for node {Arg_1}.",
      "translation": "La eliminación de registro de nodo se ha completado para el nodo {Arg_1}."
    },
    {
      "id": "Error unregistering the node. The node is not found from the database.",
      "translation": "Error al anular el registro del nodo. No se ha encontrado el nodo en la base de datos."
    },
    {
      "id": "Error unregistering the node. The node must be in 'configured' or 'configuring' state in order to unconfigure it.",
      "translation": "Error al anular el registro del nodo. El nodo debe estar en estado 'configured' o 'configuring' para poder desconfigurarlo."
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for removeNode",
      "translation": "Se ha producido un error para la eliminación del registro del nodo. {Arg_1} es un valor incorrecto para removeNode"
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for deepClean",
      "translation": "Se ha producido un error para la eliminación del registro del nodo. {Arg_1} es un valor incorrecto para deepClean"
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for block",
      "translation": "Se ha producido un error para la eliminación del registro del nodo. {Arg_1} es un valor incorrecto para block"
    },
    {
      "id": "Unable to read node object from database, error {Arg_1}",
      "translation": "No se ha podido leer el objeto de nodo de la base de datos, error {Arg_1}"
    },
    {
      "id": "Error saving new node config state (unconfiguring) in the database: {Arg_1}",
      "translation": "Se ha producido un error al guardar el estado de configuración de nodo nuevo (unconfiguring) en la base de datos: {Arg_1}"
    },
    {
      "id": "Error in node configuration. The node is not found from the database.",
      "translation": "Se ha producido un error en la configuración de nodo. No se ha encontrado el nodo en la base de datos."
    },
    {
      "id": "Error in node configuration. The node must be in 'configured' or 'configuring' state in order to change the state to {Arg_1}.",
      "translation": "Se ha producido un error en la configuración de nodo. El nodo debe estar en estado 'configured' o 'configuring' para poder cambiar el estado a {Arg_1}."
    },
    {
      "id": "Node state transition from '{Arg_1}' to '{Arg_2}' is not supported.",
      "translation": "La transición de estado de nodo de '{Arg_1}' a '{Arg_2}' no está soportada."
    },
    {
      "id": "Failed get user input from local db. {Arg_1}",
      "translation": "No se ha podido obtener la entrada de usuario de la base de datos local. {Arg_1}"
    },
    {
      "id": "Failed to find preferences for service {Arg_1}/{Arg_2} from the local user input, error: {Arg_3}",
      "translation": "No se han podido obtener las preferencias para el servicio {Arg_1}/{Arg_2} de la entrada de usuario local, error: {Arg_3}"
    },
    {
      "id": "Error saving new node config state to database: {Arg_1}",
      "translation": "Se ha producido un error al guardar el estado de configuración de nodo nuevo en la base de datos: {Arg_1}"
    },
    {
      "id": "Complete node configuration/registration for node {Arg_1}.",
      "translation": "Completar configuración/registro de nodo para nodo {Arg_1}."
    },
    {
      "id": "Error in service configuration for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error en la configuración de servicio para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error getting service references for pattern {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al obtener referencias de servicio para el patrón {Arg_1}. {Arg_2}"
    },
    {
      "id": "Ignoring service. {Arg_1}",
      "translation": "Se está ignorando el servicio. {Arg_1}"
    },
    {
      "id": "New node policy: {Arg_1}",
      "translation": "Política de nodo nuevo: {Arg_1}"
    },
    {
      "id": "Deleted node policy",
      "translation": "Se ha suprimido la política de nodo"
    },
    {
      "id": "New node user input: {Arg_1}",
      "translation": "Entrada de usuario de nodo nuevo: {Arg_1}"
    },
    {
      "id": "No node user input to detele",
      "translation": "No hay ninguna entrada de usuario de nodo que suprimir"
    },
    {
      "id": "Deleted all node user input",
      "translation": "Se ha suprimido toda la entrada de usuario de nodo"
    },
    {
      "id": "Start service configuration with user input for {Arg_1}/{Arg_2}.",
      "translation": "Iniciar configuración de servicio con la entrada de usuario para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Start service auto configuration for {Arg_1}/{Arg_2}.",
      "translation": "Iniciar configuración automática de servicio para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete service configuration for {Arg_1}/{Arg_2}.",
      "translation": "Completar configuración de servicio para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete service auto configuration for {Arg_1}/{Arg_2}.",
      "translation": "Completar configuración automática de servicio para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Variable {Arg_1} is missing in the service configuration for {Arg_2}/{Arg_3}. It may prevent an agreement if the deployment policy does not contain the setting for the missing variable.",
      "translation": "La variable {Arg_1} falta en la configuración de servicio para {Arg_2}/{Arg_3}. Puede impedir un acuerdo si la política de despliegue no contiene el valor para la variable ausente."
    },
    {
      "id": "Error configuring service {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al configurar el servicio {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error changing service configstate {Arg_1}, error {Arg_2}",
      "translation": "Se ha producido un error al cambiar el estado de configuración del servicio {Arg_1}, error {Arg_2}"
    },
    {
      "id": "Start changing service configuration state to {Arg_1} for {Arg_2} for the node.",
      "translation": "Iniciar el cambio de estado de configuración de servicio a {Arg_1} para {Arg_2} para el nodo."
    },
    {
      "id": "Complete changing service configuration state to {Arg_1} for {Arg_2} for the node.",
      "translation": "Completar el cambio de estado de configuración de servicio a {Arg_1} para {Arg_2} para el nodo."
    },
    {
      "id": "Error converting the selections into Selectors: {Err}",
      "translation": "Se ha producido un error al convertir las seleccione en selectores: {Err}"
    },
    {
      "id": "Name, or Org is empty string.",
      "translation": "El nombre o la organización es una serie vacía."
    },
    {
      "id": "The serviceVersions array is empty.",
      "translation": "La matriz serviceVersions está vacía."
    },
    {
      "id": "properties contains an invalid property: {Err}",
      "translation": "Las propiedades contienen una propiedad no válida: {Err}"
    },
    {
      "id": "The property {PROPSVCPRIVILEGED} must have a boolean value (true or false).",
      "translation": "La propiedad {PROPSVCPRIVILEGED} debe tener un valor booleano (true o false)."
    },
    {
      "id": "Node heartbeat failed for node {Arg_1}/{Arg_2}. Error: {Arg_3}",
      "translation": "La pulsación de nodo ha fallado para el nodo {Arg_1}/{Arg_2}. Error: {Arg_3}"
    },
    {
      "id": "Node heartbeat restored for node {Arg_1}/{Arg_2}.",
      "translation": "La pulsación de nodo se ha restaurado para el nodo {Arg_1}/{Arg_2}."
    },
    {
      "id": "[verbose] {M}",
      "translation": "[verbose] {M}"
    },
    {
      "id": "Error: {Msg}",
      "translation": "Error: {Msg}"
    },
    {
      "id": "Warning: {Msg}",
      "translation": "Aviso: {Msg}"
    },
    {
      "id": "failed to unmarshal bytes from {ErrMsg}: {Err}",
      "translation": "No se han podido desordenar los bytes de {ErrMsg}: {Err}"
    },
    {
      "id": "failed to marshal data type from {ErrMsg}: {Err}",
      "translation": "No se ha podido ordenar el tipo de datos de {ErrMsg}: {Err}"
    },
    {
      "id": "problem testing api key match: {Err}",
      "translation": "Se ha producido un problema al probar la coincidencia de clave de API: {Err}"
    },
    {
      "id": "Using API key",
      "translation": "Utilizando clave de API"
    },
    {
      "id": "unable to create docker client: {Err}",
      "translation": "No se ha podido crear el cliente de Docker: {Err}"
    },
    {
      "id": "docker auth domainName: {DomainName}",
      "translation": "Nombre de dominio de autorización de Docker: {DomainName}"
    },
    {
      "id": "unable to load docker credentials for {Domain}: {Err}",
      "translation": "No se han podido cargar las credenciales de {Domain}: {Err}."
    },
    {
      "id": "unable to find docker credentials for {Domain}",
      "translation": "No se han podido encontrar las credenciales de Docker para {Domain}"
    },
    {
      "id": "Pushing {ImageName}...",
      "translation": "Enviando {ImageName}..."
    },
    {
      "id": "could not get docker credentials from ~/.docker/config.json: {Err}. Maybe you need to run 'docker login ...' to provide credentials for the image registry.",
      "translation": "No se han podido obtener las credenciales de Docker de ~/.docker/config.json: {Err}. Puede que necesite ejecutar 'docker login ...' para proporcionar credenciales para el registro de imágenes."
    },
    {
      "id": "unable to push docker image {Repository____tag}: {Err}",
      "translation": "No se ha podido enviar la imagen de Docker {Repository____tag}: {Err}"
    },
    {
      "id": "Pulling {ImageName}...",
      "translation": "Extrayendo {ImageName}..."
    },
    {
      "id": "unable to get docker auth for docker.io or {Domain} domain: {Err}",
      "translation": "No se ha podido obtener la autorización de Docker para docker.io o el dominio {Domain}: {Err}"
    },
    {
      "id": "unable to pull docker image {Repository____tag}. Docker credentials were not found. Maybe you need to run 'docker login ...' if the image registry is private. Error: {Err}: {LoginErr}",
      "translation": "No se ha podido extraer la imagen de Docker {Repository____tag}. No se han encontrado credenciales de Docker. Puede que necesite ejecutar 'docker login ...' si el registro de imagen es privado. Error: {Err}: {LoginErr}"
    },
    {
      "id": "unable to pull docker image {Repository____tag}: {Err}",
      "translation": "No se ha podido extraer la imagen de Docker {Repository____tag}: {Err}"
    },
    {
      "id": "Could not find the image digest in the docker output, retrieving image digest directly from the image.",
      "translation": "No se ha podido encontrar el resumen de imagen en la salida de Docker; se va a recuperar el resumen de imagen directamente de la imagen."
    },
    {
      "id": "could not inspect image {ImageName}: {Err}.",
      "translation": "No se ha podido inspeccionar la imagen {ImageName}: {Err}."
    },
    {
      "id": "could not find digest for image {ImageName}.",
      "translation": "No se ha podido encontrar el resumen de la imagen {ImageName}."
    },
    {
      "id": "the id can not contain more than 1 '/'",
      "translation": "El ID no puede contener más de un símbolo '/'"
    },
    {
      "id": "reading stdin failed: {Err}",
      "translation": "La lectura de la entrada estándar ha fallado: {Err}"
    },
    {
      "id": "reading {FilePath} failed: {Err}",
      "translation": "La lectura de {FilePath} ha fallado: {Err}"
    },
    {
      "id": "Warning: environment variable '{EnvVarName}' is referenced in input file, but not defined in the environment.",
      "translation": "Aviso: en el archivo de entrada se hace referencia a la variable de entorno '{EnvVarName}', pero esta no está definida en el entorno."
    },
    {
      "id": "Error reading input, error {Err}",
      "translation": "Se ha producido un error al leer la entrada, error {Err}"
    },
    {
      "id": "Exiting.",
      "translation": "Saliendo."
    },
    {
      "id": "Failed to get absolute path for file {KeyFile}. {Err}",
      "translation": "No se ha podido obtener la vía de acceso absoluta para el archivo {KeyFile}. {Err}"
    },
    {
      "id": "Error parsing HORIZON_URL: {Err}",
      "translation": "Error al analizar HORIZON_URL: {Err}"
    },
    {
      "id": "Error parsing host of the HORIZON_URL: {Err}",
      "translation": "Error al analizar el host de HORIZON_URL: {Err}"
    },
    {
      "id": "Error parsing port of the HORIZON_URL: {Err}",
      "translation": "Error al analizar el puerto de HORIZON_URL: {Err}"
    },
    {
      "id": "Unexpected port of the HORIZON_URL: {PortInt}",
      "translation": "Puerto inesperado de HORIZON_URL: {PortInt}"
    },
    {
      "id": "The agbot url: {EnvVar}",
      "translation": "El URL de agbot: {EnvVar}"
    },
    {
      "id": "Error reading HTTP response, error {Err}",
      "translation": "Se ha producido un error al leer la respuesta HTTP, error {Err}"
    },
    {
      "id": "Can't connect to the Horizon REST API to run {ApiMethod}. Run '{StatusCommand}' to check if the Horizon agent is running. Or run '{StatusURL}' to check the Horizon agent status. Or set HORIZON_URL to connect to another local port that is connected to a remote Horizon agent via a ssh tunnel. Specific error is: {Err}",
      "translation": "No se puede conectar con la API REST de Horizon para ejecutar {ApiMethod}. Ejecute '{StatusCommand}' para comprobar si el agente de Horizon está en ejecución. O ejecute '{StatusURL}' para comprobar el estado del agente de Horizon. O establezca HORIZON_URL para conectar con otro puerto local que esté conectado con un agente de Horizon remoto a través de un túnel ssh. El error específico es: {Err}"
    },
    {
      "id": "Can't connect to the Horizon REST API to run {ApiMethod}. Maybe the ssh tunnel associated with that port is down? Or maybe the remote Horizon agent at the other end of that tunnel is down. Specific error is: {Err}",
      "translation": "No se puede conectar con la API REST de Horizon para ejecutar {ApiMethod}. ¿Puede que el túnel ssh asociado a ese puerto esté inactivo? O puede que el agente Horizon remoto en el otro extremo del túnel esté inactivo. El error específico es: {Err}"
    },
    {
      "id": "{ApiMsg} new request failed: {Err}",
      "translation": "La solicitud nueva de {ApiMsg} ha fallado: {Err}"
    },
    {
      "id": "HTTP code: {HttpCode}",
      "translation": "Código HTTP: {HttpCode}"
    },
    {
      "id": "Bad HTTP code from {ApiMsg}: {HttpCode}",
      "translation": "Código HTTP erróneo de {ApiMsg}: {HttpCode}"
    },
    {
      "id": "bad HTTP code from {ApiMsg}: {HttpCode}",
      "translation": "Código HTTP erróneo de {ApiMsg}: {HttpCode}"
    },
    {
      "id": "Failed to read body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido leer la respuesta del cuerpo de {ApiMsg}: {Err}"
    },
    {
      "id": "failed to read body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido leer la respuesta del cuerpo de {ApiMsg}: {Err}"
    },
    {
      "id": "Failed to unmarshal body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido desordenar la respuesta del cuerpo de {ApiMsg}: {Err}"
    },
    {
      "id": "failed to unmarshal body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido desordenar la respuesta del cuerpo de {ApiMsg}: {Err}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}: {Body}",
      "translation": "Código HTTP erróneo {HttpCode} de {ApiMsg}: {Body}"
    },
    {
      "id": "failed to marshal body for {ApiMsg}: {Err}",
      "translation": "No se ha podido ordenar el cuerpo para {ApiMsg}: {Err}"
    },
    {
      "id": "HZN_AGBOT_URL is not defined",
      "translation": "HZN_AGBOT_URL no está definido"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}, output: {StringbodyBytes}",
      "translation": "Código HTTP erróneo {HttpCode} de {ApiMsg}, salida: {StringbodyBytes}"
    },
    {
      "id": "failed to unmarshal exchange body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido desordenar la respuesta del cuerpo de Exchange de {ApiMsg}: {Err}"
    },
    {
      "id": "failed to marshal exchange output from {ApiMsg}: {Err}",
      "translation": "No se ha podido desordenar la salida de Exchange de {ApiMsg}: {Err}"
    },
    {
      "id": "Failed to unmarshal bytes. {Err}",
      "translation": "No se han podido desordenar los bytes. {Err}"
    },
    {
      "id": "Error getting {OldMgmtHubCertPath} from {ANAXOVERWRITEFILE}: {Err}",
      "translation": "Se ha producido un error al obtener {OldMgmtHubCertPath} de {ANAXOVERWRITEFILE}: {Err}"
    },
    {
      "id": "Encountered error reading ICP cert file {IcpCertPath}: {Err}",
      "translation": "Se ha producido un error al leer el archivo de certificado de ICP {IcpCertPath}: {Err}"
    },
    {
      "id": "Error getting HZN_EXCHANGE_URL from {ANAXOVERWRITEFILE}. {Err}",
      "translation": "Se ha producido un error al obtener HZN_EXCHANGE_URL de {ANAXOVERWRITEFILE}. {Err}"
    },
    {
      "id": "Error getting ExchangeUrl from {ANAXCONFIGFILE}. {Err}",
      "translation": "Se ha producido un error al obtener ExchangeUrl de {ANAXCONFIGFILE}. {Err}"
    },
    {
      "id": "HZN_EXCHANGE_URL is not set, get it from horizon agent configuration on the node.",
      "translation": "HZN_EXCHANGE_URL no se ha establecido, obténgalo de la configuración del agente de Horizon en el nodo."
    },
    {
      "id": "Could not get the Exchange url from environment variable HZN_EXCHANGE_URL or the horizon agent",
      "translation": "No se ha podido obtener el URL de Exchange de la variable de entorno HZN_EXCHANGE_URL o el agente de Horizon"
    },
    {
      "id": "The exchange url: {ExchUrl}",
      "translation": "El URL de Exchange: {ExchUrl}"
    },
    {
      "id": "Error getting HZN_FSS_CSSURL from {ANAXOVERWRITEFILE}. {Err}",
      "translation": "Se ha producido un error al obtener HZN_FSS_CSSURL de {ANAXOVERWRITEFILE}. {Err}"
    },
    {
      "id": "Error getting model management service Url from {ANAXCONFIGFILE}. {Err}",
      "translation": "Se ha producido un error al obtener el URL de servicio de gestión de modelo de {ANAXCONFIGFILE}. {Err}"
    },
    {
      "id": "HZN_FSS_CSSURL is not set, get it from horizon agent configuration on the node.",
      "translation": "HZN_FSS_CSSURL no se ha establecido, obténgalo de la configuración del agente de Horizon en el nodo."
    },
    {
      "id": "Could not get the model management service url from environment variable HZN_FSS_CSSURL or the horizon agent",
      "translation": "No se ha podido obtener el URL de servicio de gestión de modelos de la variable de entorno HZN_FSS_CSSURL o el agente de Horizon."
    },
    {
      "id": "The model management service url: {MmsUrl}",
      "translation": "El URL de servicio de gestión de modelos: {MmsUrl}"
    },
    {
      "id": "HZN_SDO_SVC_URL is not set, get it from {ANAXOVERWRITEFILE}.",
      "translation": "HZN_SDO_SVC_URL no se ha establecido, obténgalo en {ANAXOVERWRITEFILE}."
    },
    {
      "id": "Error getting HZN_SDO_SVC_URL from {ANAXOVERWRITEFILE}: {Err}",
      "translation": "Error al obtener HZN_SDO_SVC_URL de {ANAXOVERWRITEFILE}: {Err}"
    },
    {
      "id": "Could not get the HZN_SDO_SVC_URL value from the environment, {ANAXOVERWRITEFILE}, or one of the hzn.json files",
      "translation": "No se ha podido obtener el valor de HZN_SDO_SVC_URL del entorno, {ANAXOVERWRITEFILE}, o uno de los archivos hzn.json"
    },
    {
      "id": "The SDO service url: {SdoUrl}",
      "translation": "URL de servicio SDO: {SdoUrl}"
    },
    {
      "id": "Can't connect to the Horizon {HorizonService} REST API to run {ApiMethod}. Set {ServiceEnvVarName} to use {Article} {HorizonService_1} other than the one the Horizon Agent is currently configured for. Specific error is: {Err}",
      "translation": "No se puede conectar con la API REST {HorizonService} de Horizon para ejecutar {ApiMethod}. Establezca {ServiceEnvVarName} para utilizar {Article} {HorizonService_1} en lugar del agente de Horizon para el que está configurado actualmente. El error específico es: {Err}"
    },
    {
      "id": "Can't connect to the Horizon {HorizonService} REST API to run {ApiMethod}. Maybe {ServiceEnvVarName} is set incorrectly? Or unset {ServiceEnvVarName_1} to use the {HorizonService_1} that the Horizon Agent is configured for. Specific error is: {Err}",
      "translation": "No se puede conectar con la API REST {HorizonService} de Horizon para ejecutar {ApiMethod}. ¿Puede que {ServiceEnvVarName} se haya establecido incorrectamente? O anule el establecimiento de {ServiceEnvVarName_1} para utilizar {HorizonService_1} para el que el agente de Horizon está configurado. El error específico es: {Err}"
    },
    {
      "id": "failed to marshal exchange body for {ApiMsg}: {Err}",
      "translation": "No se ha podido ordenar el cuerpo de Exchange para {ApiMsg}: {Err}"
    },
    {
      "id": "Failed to get file info: {Err}",
      "translation": "No se ha podido obtener información del archivo: {Err}"
    },
    {
      "id": "Malformed URL: {UrlPath}. {ErrUrl}",
      "translation": "URL mal formado: {UrlPath}. {ErrUrl}"
    },
    {
      "id": "Uploading: {Float32totalSent__float32bodyLen__100} {}",
      "translation": "Cargando: {Float32totalSent__float32bodyLen__100} {}"
    },
    {
      "id": "unable to open object file {Name}: {Err}",
      "translation": "No se ha podido abrir el archivo de objeto {Name}: {Err}"
    },
    {
      "id": "Encountered HTTP error: {Err} calling {Service} REST API {ApiMsg}. HTTP status: {Httpstatus}. Will retry.",
      "translation": "Se ha encontrado un error HTTP: {Err} al llamar a la API REST de {Service} {ApiMsg}. Estado de HTTP: {Httpstatus}. Se volverá a intentar."
    },
    {
      "id": "Encountered HTTP error: {Err} calling {Service} REST API {ApiMsg}. HTTP status: {Httpstatus}.",
      "translation": "Se ha encontrado un error HTTP: {Err} al llamar a la API REST de {Service} {ApiMsg}. Estado de HTTP: {Httpstatus}."
    },
    {
      "id": "failed to read exchange body response from {ApiMsg}: {Err}",
      "translation": "No se ha podido leer la respuesta del cuerpo de Exchange de {ApiMsg}: {Err}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}: {Code}, {Msg}",
      "translation": "Código HTTP erróneo {HttpCode} de {ApiMsg}: {Code}, {Msg}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}",
      "translation": "Código HTTP erróneo {HttpCode} de {ApiMsg}"
    },
    {
      "id": "exchange authentication must be specified with one of the following: the -u flag, the -n flag, HZN_EXCHANGE_USER_AUTH or HZN_EXCHANGE_NODE_AUTH",
      "translation": "Se debe especificar la autenticación de Exchange con uno de los elementos siguientes: el distintivo -u, el distintivo -n, HZN_EXCHANGE_USER_AUTH o HZN_EXCHANGE_NODE_AUTH"
    },
    {
      "id": "Verifying public key file ...",
      "translation": "Verificando el archivo de clave pública..."
    },
    {
      "id": "provided public key is not valid; error: {Err}",
      "translation": "La clave pública proporcionada no es válida; error: {Err}"
    },
    {
      "id": "Checking private key file format ...",
      "translation": "Comprobando el formato del archivo de clave privada..."
    },
    {
      "id": "provided private key is not valid; error: {Err}",
      "translation": "La clave privada proporcionada no es válida; error: {Err}"
    },
    {
      "id": "{Err}. Please create the signing key.",
      "translation": "{Err}. Cree la clave de firma."
    },
    {
      "id": "running: {CmdStr}",
      "translation": "Ejecutando: {CmdStr}"
    },
    {
      "id": "did not get a command object",
      "translation": "No se ha obtenido un objeto de mandato"
    },
    {
      "id": "Could not get Stdin pipe, error: {Err}",
      "translation": "No se ha podido obtener el canal de comunicación de entrada estándar, error: {Err}"
    },
    {
      "id": "could not retrieve output from command, error: {Err}",
      "translation": "No se ha podido recuperar la salida del mandato, error: {Err}"
    },
    {
      "id": "could not retrieve stderr from command, error: {Err}",
      "translation": "No se ha podido recuperar el error estándar del mandato, error: {Err}"
    },
    {
      "id": "Unable to start command, error: {Err}",
      "translation": "No se ha podido iniciar el mandato, error: {Err}"
    },
    {
      "id": "Unable to write to stdin of command, error: {Err}",
      "translation": "No se ha podido escribir en la entrada estándar del mandato, error: {Err}"
    },
    {
      "id": "Unable to close stdin, error: {Err}",
      "translation": "No se ha podido cerrar la entrada estándar, error: {Err}"
    },
    {
      "id": "could not read stdout, error: {Err}",
      "translation": "No se ha podido leer la salida estándar, error: {Err}"
    },
    {
      "id": "could not read stderr, error: {Err}",
      "translation": "No se ha podido leer el error estándar, error: {Err}"
    },
    {
      "id": "command failed: {Err}, stderr: {StringstderrBytes}",
      "translation": "El mandato ha fallado: {Err}, error estándar: {StringstderrBytes}"
    },
    {
      "id": "Unable to use {HTTPRequestTimeoutOverride} to set the request timeout, the value is not a valid number: {EnvTimeout}",
      "translation": "No se ha podido utilizar {HTTPRequestTimeoutOverride} para establecer el tiempo de espera de la solicitud, el valor no es un número válido: {EnvTimeout}"
    },
    {
      "id": "HTTP request timeout set to {RequestTimeout} seconds",
      "translation": "El tiempo de espera de la solicitud HTTP se ha establecido en {RequestTimeout} segundos"
    },
    {
      "id": "Error converting environmental variable HZN_HTTP_RETRIES {MaxRetriess} to integer. {Err1}",
      "translation": "Error al convertir la variable de entorno HZN_HTTP_RETRIES {MaxRetriess} en entero. {Err1}"
    },
    {
      "id": "Error converting environmental variable HZN_HTTP_RETRY_INTERVAL {RetryIntervals} to integer. {Err1}",
      "translation": "Error al convertir la variable de entorno HZN_HTTP_RETRY_INTERVAL {RetryIntervals} en entero. {Err1}"
    },
    {
      "id": "{Image} parsed into: domain={Domain}, path={Path}, tag={Tag}",
      "translation": "{Image} analizada en: domain={Domain}, path={Path}, tag={Tag}"
    },
    {
      "id": "Warning: could not parse image path '{Image}'. Not pushing it to a docker registry, just including it in the 'deployment' field as-is.",
      "translation": "Aviso: no se ha podido analizar la vía de acceso de imagen '{Image}'. No se envía a un registro Docker, solo se incluye tal cual en el campo 'deployment'."
    },
    {
      "id": "Docker pull failure: {Err}",
      "translation": "Anomalía de extracción de Docker: {Err}"
    },
    {
      "id": "Provided log-driver ({LogDriver}) does not support logs viewing. Logs are only available on the following drivers: {DockerDriversWithLoggingSupport}",
      "translation": "El controlador de registro proporcionado ({LogDriver}) no da soporte a la visualización de registros. Los registros solo están disponibles en los siguientes controladores: {DockerDriversWithLoggingSupport}"
    },
    {
      "id": "Error creating StdoutPipe for command: {Err}",
      "translation": "Se ha producido un error al crear StdoutPipe para el mandato: {Err}"
    },
    {
      "id": "Error starting command: {Err}",
      "translation": "Se ha producido un error al iniciar el mandato: {Err}"
    },
    {
      "id": "Error waiting for command: {Err}",
      "translation": "Se ha producido un error al esperar el mandato: {Err}"
    },
    {
      "id": "{SysLogPath} could not be opened or does not exist: {Err}",
      "translation": "{SysLogPath} no se ha podido abrir o no existe: {Err}"
    },
    {
      "id": "{SysLogPath} could not get stats: {Err}",
      "translation": "{SysLogPath} no ha podido obtener estadísticas: {Err}"
    },
    {
      "id": "Error reading from {SysLogPath}: {Err}",
      "translation": "Error al leer en {SysLogPath}: {Err}"
    },
    {
      "id": "Unable to state {SysLogPath}: {Err}",
      "translation": "No se puede indicar {SysLogPath}: {Err}"
    },
    {
      "id": "no service name",
      "translation": "Ningún nombre de servicio"
    },
    {
      "id": "no docker image for service {ServiceName}",
      "translation": "Ninguna imagen de Docker para el servicio {ServiceName}"
    },
    {
      "id": "failed to marshal body for {D}: {Err}",
      "translation": "No se ha podido ordenar el cuerpo para {D}: {Err}"
    },
    {
      "id": "failed to unmarshal json for deployment field {StringjsonBytes}: {Err}",
      "translation": "No se ha podido desordenar json para el campo de despliegue {StringjsonBytes}: {Err}"
    },
    {
      "id": "user input {Name} has no default value and is not set",
      "translation": "La entrada de usuario {Name} no tiene ningún valor predeterminado y no está establecida"
    },
    {
      "id": "'requiredServices' is not supported for cluster type service.",
      "translation": "'requiredServices' no está soportado para servicio de tipo de clúster."
    },
    {
      "id": "Failed to convert version {Ver} for service {ReqSvc} to version range expression.",
      "translation": "No se ha podido convertir la conversión {Ver} para el servicio {ReqSvc} a la expresión de rango de versión."
    },
    {
      "id": "Error retrieving service from the Exchange for {ReqSvc}. {Err}",
      "translation": "Error al recuperar el servicio de Exchange para {ReqSvc}. {Err}"
    },
    {
      "id": "The required service {SId} has the wrong service type: {SType}.",
      "translation": "El servicio obligatorio {SId} tiene el tipo de servicio incorrecto: {SType}."
    },
    {
      "id": "The dependent service {Id} for the required service {SId} has the wrong service type: {SType1}.",
      "translation": "El servicio dependiente {Id} para el servicio necesario {SId} tiene el tipo de servicio incorrecto: {SType1}."
    },
    {
      "id": "failed to unmarshal json input {JsonBytes}: {Err}",
      "translation": "No se ha podido desordenar la entrada json {JsonBytes}: {Err}"
    },
    {
      "id": "Error getting new user input format. {Err1}",
      "translation": "Error al obtener el formato de entrada del nuevo usuario. {Err1}"
    },
    {
      "id": "Failed to create json object for user input. {Err1}",
      "translation": "No se ha podido crear el objeto json para la entrada de usuario. {Err1}"
    },
    {
      "id": "Deployment policy and pattern are mutually exclusive.",
      "translation": "El patrón y la política de despliegue se excluyen mutuamente."
    },
    {
      "id": "Neither deployment policy nor pattern is specified.",
      "translation": "No se ha especificado ni la política ni el patrón de despliegue."
    },
    {
      "id": "Incompatible",
      "translation": "Incompatible"
    },
    {
      "id": "Compatible",
      "translation": "Compatible"
    },
    {
      "id": "The given node id is empty.",
      "translation": "El nodo dado está vacío."
    },
    {
      "id": "Organization is not specified in the given node id: {NodeId}.",
      "translation": "La organización no está especificada en el ID de nodo dado: {NodeId}."
    },
    {
      "id": "Error getting node {NodeId} from the Exchange. {Err}",
      "translation": "Error al obtener el nodo {NodeId} de Exchange. {Err}"
    },
    {
      "id": "No node found for this node id {NodeId}.",
      "translation": "No se ha encontrado ningún nodo para este ID de nodo {NodeId}."
    },
    {
      "id": "Error unmarshaling deployment string to internal deployment structure: {Err}",
      "translation": "Error al desordenar la serie de despliegue en la estructura de despliegue interna: {Err}"
    },
    {
      "id": "Invalid node type: {NodeType}. It must be 'device' or 'cluster'.",
      "translation": "Tipo de nodo no válido: {NodeType}. Debe ser 'device' o 'cluster'."
    },
    {
      "id": "The input node type '{NodeType}' does not match the node type '{ExchNodeType}' from the node {NodeId}.",
      "translation": "El tipo de nodo de entrada '{NodeType}' no coincide con el tipo de nodo '{ExchNodeType}' del nodo {NodeId}."
    },
    {
      "id": "Service does not have deployment configuration for node type 'device'.",
      "translation": "El servicio no tiene una configuración de despliegue para el tipo de nodo 'device'."
    },
    {
      "id": "Service does not have cluster deployment configuration for node type 'cluster'.",
      "translation": "El servicio no tiene una configuración de despliegue de clúster para el tipo de nodo 'cluster'."
    },
    {
      "id": "Unable to create version expression from {VersionRange}. {Err}",
      "translation": "No se puede crear la expresión de versión de {VersionRange}. {Err}"
    },
    {
      "id": "Error retrieving dependent services from the Exchange for {SDep}. {Err}",
      "translation": "Se ha producido un error al recuperar servicios dependientes de Exchange para {SDep}. {Err}"
    },
    {
      "id": "Failed to find definition for dependent services of {TopId}. Compatability of {PROPNODEPRIVILEGED} cannot be fully evaluated until all services are in the Exchange.",
      "translation": "No se ha podido encontrar la definición para los servicios dependientes de {TopId}. La compatibilidad de {PROPNODEPRIVILEGED} no se puede evaluar completamente hasta que todos los servicios estén en Exchange."
    },
    {
      "id": "The PolicyCheck input cannot be null",
      "translation": "La entrada PolicyCheck no puede ser nula"
    },
    {
      "id": "The input node architecture {NodeArch} does not match the Exchange node architecture {Arch} for node {NodeId}.",
      "translation": "La arquitectura de nodo de entrada {NodeArch} no coincide con la arquitectura de nodo de Exchange {Arch} para el nodo {NodeId}."
    },
    {
      "id": "Policy Incompatible",
      "translation": "Política incompatible"
    },
    {
      "id": "Architecture does not match.",
      "translation": "La arquitectura no coincide."
    },
    {
      "id": "Failed to get services for all archetctures for {Org}/{WorkloadURL} version {Version}. {Err}",
      "translation": "No se han podido obtener servicios para todas las arquitecturas de {Org}/{WorkloadURL} versión {Version}. {Err}"
    },
    {
      "id": "Failed to validate the service policy. {Err}",
      "translation": "No se ha podido validar la política de servicio. {Err}"
    },
    {
      "id": "Service with 'arch' {NodeArch} cannot be found in the deployment policy.",
      "translation": "El servicio con 'arch' {NodeArch} no se puede encontrar en la política de despliegue."
    },
    {
      "id": "No services found in the deployment policy.",
      "translation": "No se han encontrado servicios en la política de despliegue."
    },
    {
      "id": "Node policy cannot be null.",
      "translation": "La política de nodo no puede ser nula."
    },
    {
      "id": "Deployment policy cannot be null.",
      "translation": "La política de despliegue no puede ser nula."
    },
    {
      "id": "Merged service policy cannot be null.",
      "translation": "La política de servicio fusionada no puede ser nula."
    },
    {
      "id": "Error merging node policy with arch property. {Err}",
      "translation": "Se ha producido un error al fusionar la política de nodo con la propiedad arch. {Err}"
    },
    {
      "id": "Failed to validate the node policy. {Err}",
      "translation": "No se ha podido validar la política de nodo. {Err}"
    },
    {
      "id": "Failed to convert node policy to internal policy format for node {NodeId}: {Err}",
      "translation": "No se ha podido convertir la política de nodo a un formato de política interna para el nodo {NodeId}: {Err}"
    },
    {
      "id": "No node policy found for this node {NodeId}.",
      "translation": "No se ha encontrado ninguna política para este nodo {NodeId}."
    },
    {
      "id": "Neither node policy nor node id is specified.",
      "translation": "No se ha especificado la política de nodo ni el ID de nodo."
    },
    {
      "id": "Node id is empty.",
      "translation": "El ID de nodo está vacío."
    },
    {
      "id": "Organization is not specified in the node id: {NodeId}.",
      "translation": "La organización no está especificada en el ID de nodo: {NodeId}."
    },
    {
      "id": "Error trying to query node policy for {NodeId}: {Err}",
      "translation": "Se ha producido un error al intentar consultar la política de nodo para {NodeId}: {Err}"
    },
    {
      "id": "Failed to validate the node policy for node {NodeId}. {Err}",
      "translation": "No se ha podido validar la política de nodo para el nodo {NodeId}. {Err}"
    },
    {
      "id": "Failed to convert node policy to internal policy for node {NodeId}: {Err}",
      "translation": "No se ha podido convertir la política de nodo en una política interna para el nodo {NodeId}: {Err}"
    },
    {
      "id": "Failed to convert deployment policy {BpId} to internal policy: {Err1}",
      "translation": "No se ha podido convertir la política de despliegue {BpId} en política interna: {Err1}"
    },
    {
      "id": "Validation failure for deployment policy {BpId}. {Err}",
      "translation": "Error de validación para la política de despliegue {BpId}. {Err}"
    },
    {
      "id": "No services specified in the given deployment policy {BpId}.",
      "translation": "No se han especificado servicios en la política de despliegue especificada {BpId}."
    },
    {
      "id": "No services specified in the deployment policy {Name}.",
      "translation": "No se han especificado servicios en la política de despliegue {Name}."
    },
    {
      "id": "Neither deployment policy nor deployment policy id is specified.",
      "translation": "No se ha especificado la política de despliegue ni el ID de política de despliegue."
    },
    {
      "id": "Deployment policy id is empty.",
      "translation": "El ID de política de despliegue está vacío."
    },
    {
      "id": "Organization is not specified in the deployment policy id: {BpId}.",
      "translation": "La organización no está especificada en el ID de política de despliegue: {BpId}."
    },
    {
      "id": "Unable to get deployment policy for {BpId}, {Err}",
      "translation": "No se ha podido obtener la política de despliegue para {BpId}, {Err}"
    },
    {
      "id": "No deployment policy found for this id {BpId}.",
      "translation": "No se ha encontrado ninguna política de despliegue para este ID {BpId}."
    },
    {
      "id": "Failed to convert deployment policy {BpId} to internal policy format: {Err}",
      "translation": "No se ha podido convertir la política de despliegue {BpId} a un formato de política interna: {Err}"
    },
    {
      "id": "Service policy id is empty.",
      "translation": "El ID de política de servicio está vacío."
    },
    {
      "id": "Organization is not specified in the service policy id: {SvcId}.",
      "translation": "La organización no está especificada en el ID de política de servicio: {SvcId}."
    },
    {
      "id": "Error trying to query service policy for service id {SvcId}: {Err}",
      "translation": "Se ha producido un error al intentar consultar la política de servicio para el ID de servicio {SvcId}: {Err}"
    },
    {
      "id": "Error validating the service policy {SvcId}. {Err}",
      "translation": "Se ha producido un error al validar la política de servicio {SvcId}. {Err}"
    },
    {
      "id": "Service name is empty.",
      "translation": "El nombre de servicio está vacío."
    },
    {
      "id": "Service organization is empty.",
      "translation": "La organización de servicio está vacía."
    },
    {
      "id": "Error trying to query service policy for {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}",
      "translation": "Se ha producido un error al intentar consultar la política de servicio para {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}"
    },
    {
      "id": "Failed to validate the service policy for {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}",
      "translation": "No se ha podido validar la política de servicio para {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}"
    },
    {
      "id": "The given deployment policy should not be null.",
      "translation": "La política de despliegue dada no debe ser nula."
    },
    {
      "id": "Error merging deployment policy with service policy. {Err}",
      "translation": "Se ha producido un error al fusionar la política de despliegue con la política de servicio. {Err}"
    },
    {
      "id": "Unable to find service definition from the input services.",
      "translation": "No se puede encontrar la definición de servicio de los servicios de entrada."
    },
    {
      "id": "The SecretBindingCheck input cannot be null",
      "translation": "La entrada SecretBindingCheck no puede ser nula"
    },
    {
      "id": "Node type '{NodeType}' does not support secret binding check.",
      "translation": "El tipo de nodo '{NodeType}' no da soporte a la comprobación de enlace de secreto."
    },
    {
      "id": "No service versions with architecture {NodeArch} specified in the deployment policy or pattern.",
      "translation": "No se ha especificado ninguna versión de servicio con la arquitectura {NodeArch} en el patrón o la política de despliegue."
    },
    {
      "id": "No service versions specified in the deployment policy or pattern.",
      "translation": "No se ha especificado ninguna versión de servicio en el patrón o la política de despliegue."
    },
    {
      "id": "Secret Binding Incompatible",
      "translation": "Enlace de secreto no compatible"
    },
    {
      "id": "Type Incompatible",
      "translation": "Tipo incompatible"
    },
    {
      "id": "Error getting services for all archetctures for {ServiceOrg}/{ServiceURL} version {Version}. {Err}",
      "translation": "Se ha producido un error al obtener servicios para todas las arquitecturas para {ServiceOrg}/{ServiceURL} versión {Version}. {Err}"
    },
    {
      "id": "Service definition not found in the input.",
      "translation": "No se ha encontrado la definición de servicio en la entrada."
    },
    {
      "id": "Warning: The following secret bindings are not required by any services: {ExtraneousSB}",
      "translation": "Aviso: Los siguientes enlaces de secreto no son necesarios para ningún servicio: {ExtraneousSB}"
    },
    {
      "id": "Service with 'arch' {NodeArch} cannot be found in the deployment policy or pattern.",
      "translation": "El servicio con 'arch' {NodeArch} no se puede encontrar en la política o el patrón de despliegue."
    },
    {
      "id": "No services found in the deployment policy or pattern.",
      "translation": "No se han encontrado servicios en el patrón o la política de despliegue."
    },
    {
      "id": "The input service definition object cannot be null.",
      "translation": "El objeto de definición de servicio de entrada no puede ser nulo."
    },
    {
      "id": "Error verifying secret in the secret manager. {Err}",
      "translation": "Error al verificar el secreto en el gestor de secretos. {Err}"
    },
    {
      "id": "The input service spec object cannot be null.",
      "translation": "El objeto de especificación de servicio de entrada no puede ser nulo."
    },
    {
      "id": "Failed to find the dependent services for {Org}/{URL} {Arch} {Version}. {Err}",
      "translation": "No se han podido encontrar los servicios dependientes para {Org}/{URL} {Arch} {Version}. {Err}"
    },
    {
      "id": "Secret binding for a cluster service is not supported.",
      "translation": "El enlace de secreto para un servicio de clúster no está soportado."
    },
    {
      "id": "No secret binding found for the following service secrets: {NbArray}.",
      "translation": "No se ha encontrado ningún enlace de secreto para los siguientes secretos de servicio: {NbArray}."
    },
    {
      "id": "Wrong version string {ServiceVersionRange} specified in secret binding for service {SvcOrg}/{SvcName} {SvcVersion} {SvcArch}, error {Err}",
      "translation": "Se ha especificado una serie de versión incorrecta  {ServiceVersionRange} en el enlace de secreto para el servicio {SvcOrg}/{SvcName} {SvcVersion} {SvcArch}, error {Err}"
    },
    {
      "id": "Error checking version {SvcVersion} in range {VExp}. {Err}",
      "translation": "Error al comprobar la versión {SvcVersion} en el rango {VExp}. {Err}"
    },
    {
      "id": "agbot URL cannot be an empty string when checking secret binding. Please make sure HZN_AGBOT_URL is set.",
      "translation": "El URL de agbot no puede ser una serie vacía al comprobar el enlace de secreto. Asegúrese de que se ha establecido HZN_AGBOT_URL."
    },
    {
      "id": "The node organization must be provided.",
      "translation": "Se debe proporcionar la organización del nodo."
    },
    {
      "id": "Error parsing secret name in the secret binding. {Errparse}",
      "translation": "Error al analizar el nombre del secreto en el enlace de secreto. {Errparse}"
    },
    {
      "id": "Error checking secret {VaultSecretName} in the secret manager. {Err}",
      "translation": "Error al comprobar el secreto {VaultSecretName} en el gestor de secretos. {Err}"
    },
    {
      "id": "The binding secret name cannot be an empty string. The valid formats are: '<secretname>' for the organization level secret and 'user/<username>/<secretname>' for the user level secret.",
      "translation": "El nombre del secreto de enlace no puede ser una serie vacía. Los formatos válidos son: '<secretname>' para el secreto a nivel de organización y 'user/<username>/<secretname>' para el secreto a nivel de usuario."
    },
    {
      "id": "Invalid format for the binding secret name: {SecretName}. The valid formats are: '<secretname>' for the organization level secret and 'user/<username>/<secretname>' for the user level secret.",
      "translation": "Formato no válido para el nombre del secreto de enlace: {SecretName}. Los formatos válidos son: '<secretname>' para el secreto a nivel de organización y 'user/<username>/<secretname>' para el secreto a nivel de usuario."
    },
    {
      "id": "The UserInputCheck input cannot be null",
      "translation": "La entrada UserInputCheck no puede ser nula"
    },
    {
      "id": "Neither node user input nor node id is specified.",
      "translation": "No se ha especificado la entrada de usuario de nodo ni el ID de nodo."
    },
    {
      "id": "User Input Incompatible",
      "translation": "Entrada de usuario incompatible"
    },
    {
      "id": "Warning: checking node user input:  {Err}",
      "translation": "Aviso: comprobando entrada de usuario de nodo:  {Err}"
    },
    {
      "id": "Warning: checking user input for the deployment policy: {Err}",
      "translation": "Aviso: comprobando entrada de usuario para la política de despliegue: {Err}"
    },
    {
      "id": "Warning: checking user input for the pattern: {Err}",
      "translation": "Aviso: comprobando entrada de usuario para el patrón: {Err}"
    },
    {
      "id": "Error verifing user input for service {SId}. {Err}",
      "translation": "Se ha producido un error al verifica la entrada de usuario para el servicio {SId}. {Err}"
    },
    {
      "id": "Failed to verify user input for service {SId}. {Reason}",
      "translation": "No se ha podido verificar la entrada de usuario para el servicio {SId}. {Reason}"
    },
    {
      "id": "Error verifing user input for dependent service {Id}. {Err}",
      "translation": "Se ha producido un error al verificar la entrada de usuario para el servicio dependiente {Id}. {Err}"
    },
    {
      "id": "Failed to verify user input for dependent service {Id}. {Reason}",
      "translation": "No se ha podido verificar la entrada de usuario para el servicio dependiente {Id}. {Reason}"
    },
    {
      "id": "Failed to get the service from the Exchange. {Err}",
      "translation": "No se ha podido obtener el servicio de Exchange. {Err}"
    },
    {
      "id": "Service does not exist on the Exchange.",
      "translation": "El servicio no existe en Exchange."
    },
    {
      "id": "No user input found for service.",
      "translation": "No se ha encontrado ninguna entrada de usuario para el servicio."
    },
    {
      "id": "Failed to validate the user input type for variable {Name}. {Err}",
      "translation": "No se ha podido validar el tipo de entrada de usuario para la variable {Name}. {Err}"
    },
    {
      "id": "A required user input value is missing for variable {Name}.",
      "translation": "Falta un valor de entrada de usuario necesario para la variable {Name}."
    },
    {
      "id": "{Errmsg} Service {Org}/{URL} version {Version} arch {Arch} is missing in the node user input.",
      "translation": "Falta {Errmsg} servicio {Org}/{URL} versión {Version} arch {Arch} en la entrada de usuario de nodo."
    },
    {
      "id": "Service URL {URL} does not match the service URL {Name} specified in the deployment policy.",
      "translation": "El URL de servicio {URL} no coincide con el URL de servicio {Name} especificado en la política de despliegue."
    },
    {
      "id": "Service Org {Org} does not match the service org {Org_1} specified in the deployment policy.",
      "translation": "La organización de servicio {Org} no coincide con la organización de servicio {Org_1} especificada en la política de despliegue."
    },
    {
      "id": "Service architecure {Arch} does not match the service architectrure {Arch_1} specified in the deployment policy.",
      "translation": "La arquitectura de servicio {Arch} no coincide con la arquitectura de servicio {Arch_1} especificado en la política de despliegue."
    },
    {
      "id": "Service version {Version} does not match any service versions specified in the deployment policy.",
      "translation": "La versión de servicio {Version} no coincide con ninguna de las versiones de servicio especificadas en la política de despliegue."
    },
    {
      "id": "The service does not match any services in the pattern.",
      "translation": "El servicio no coincide con ningún servicio del patrón."
    },
    {
      "id": "Pattern {PatId} cannot be found on the Exchange.",
      "translation": "No se puede encontrar el patrón {PatId} en Exchange."
    },
    {
      "id": "Neither pattern nor pattern id is specified.",
      "translation": "No se ha especificado ni el patrón ni el ID de patrón."
    },
    {
      "id": "Pattern id is empty.",
      "translation": "El ID de patrón está vacío."
    },
    {
      "id": "Organization is not specified in the pattern id: {PatId}.",
      "translation": "La organización no está especificada en el ID de patrón: {PatId}."
    },
    {
      "id": "Error getting pattern {PatId} from the Exchange, {Err}",
      "translation": "Se ha producido un error al obtener el patrón {PatId} de Exchange, {Err}"
    },
    {
      "id": "No pattern found for this id {PatId}.",
      "translation": "No se ha encontrado ningún patrón para este ID {PatId}."
    },
    {
      "id": "URL must be specified in the service definition.",
      "translation": "Se debe especificar el URL en la definición de servicio."
    },
    {
      "id": "Version must be specified in the service definition for service {URL}.",
      "translation": "Se debe especificar la versión en la definición de servicio para el servicio {URL}."
    },
    {
      "id": "Invalid version format {Version} for service {URL}.",
      "translation": "Formato de versión {Version} no válido para el servicio {URL}."
    },
    {
      "id": "Arch must be specified in the service definition for service {URL}.",
      "translation": "Se debe especificar la arquitectura en la definición de servicio para el servicio {URL}."
    },
    {
      "id": "Org must be specified in the service definition for service {URL}.",
      "translation": "Se debe especificar la organización en la definición de servicio para el servicio {URL}."
    },
    {
      "id": "Validation failure for input service {SId}. {Err}",
      "translation": "Error de validación para el servicio de entrada {SId}. {Err}"
    },
    {
      "id": "The service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not referenced by the pattern or deployment policy. Please make sure the serviceOrgid, serviceUrl, serviceArch and serviceVersionRange are correct.",
      "translation": "El servicio {ServiceOrgid}/{ServiceUrl} versión {ServiceVersionRange} arqu {ServiceArch} especificado en la entrada de usuario no está referenciado por la política de patrón o de despliegue. Asegúrese de que serviceOrgid, serviceUrl, serviceArch y serviceVersionRange son correctos."
    },
    {
      "id": "The service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not referenced by the pattern or deployment policy. Please make sure the service specification is correct.",
      "translation": "El servicio {ServiceOrgid}/{ServiceUrl} versión {ServiceVersionRange} arqu {ServiceArch} especificado en la entrada de usuario no está referenciado por la política de patrón o de despliegue. Asegúrese de que la especificación de servicio especificada es correcta."
    },
    {
      "id": "Variable {Name} for service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not used. Please make sure it is a correct name.",
      "translation": "La variable {Name} para el servicio {ServiceOrgid}/{ServiceUrl} versión {ServiceVersionRange} arqu {ServiceArch} especificada en la entrada de usuario no se utiliza. Asegúrese de que sea un nombre correcto."
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported capability for a workload",
      "translation": "La configuración de despliegue {Arg_1} contiene la capacidad no soportada para una carga de trabajo"
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported capability for infrastructure container.",
      "translation": "La configuración de despliegue {Arg_1} contiene la capacidad no soportada para un contenedor de infraestructura."
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported bind for a workload, {Arg_2}",
      "translation": "La configuración de despliegue {Arg_1} contiene un enlace no soportado para una carga de trabajo, {Arg_2}"
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported bind for {Arg_2}, {Arg_3}",
      "translation": "La configuración de despliegue {Arg_1} contiene un enlace no soportado para {Arg_2}, {Arg_3}"
    },
    {
      "id": "Error Unmarshalling deployment string {Arg_1}, error: {Arg_2}",
      "translation": "Se ha producido un error al desordenar la serie de despliegue {Arg_1}, error: {Arg_2}"
    },
    {
      "id": "Error Unmarshalling deployment override string {Arg_1} for agreement {Arg_2}, error: {Arg_3}",
      "translation": "Se ha producido un error al desordenar la serie de alteración temporal de despliegue {Arg_1} para el acuerdo {Arg_2}, error: {Arg_3}"
    },
    {
      "id": "Error starting containers: {Arg_1}",
      "translation": "Se ha producido un error al iniciar los contenedores: {Arg_1}"
    },
    {
      "id": "Error starting containers for agreement {Arg_1}: {Arg_2}",
      "translation": "Se ha producido un error al iniciar los contenedores para el acuerdo {Arg_1}: {Arg_2}"
    },
    {
      "id": "Error restarting containers for agreements {Arg_1}: {Arg_2}",
      "translation": "Se ha producido un error al reiniciar los contenedores para los acuerdos {Arg_1}: {Arg_2}"
    },
    {
      "id": "Error cleaning up old containers before starting up new containers for {Arg_1}. Error: {Arg_2}",
      "translation": "Se ha producido un error al borrar contenedores antiguos antes de iniciar contenedores nuevos para {Arg_1}. Error: {Arg_2}"
    },
    {
      "id": "Failed to get a list of parent containers for service retry for {Arg_1}. {Arg_2}",
      "translation": "No se ha podido obtener una lista de contenedores padre para reintentos de servicio para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Failed to restoring the network connection with the parents for service {Arg_1}. {Arg_2}",
      "translation": "No se ha podido restaurar la conexión de red con los padres para el servicio {Arg_1}. {Arg_2}"
    },
    {
      "id": "anax terminating. Unable to access service storage direcotry specified in config: {Arg_1}. {Arg_2}",
      "translation": "anax está finalizando. No se puede acceder al directorio de almacenamiento de servicio especificado en la config: {Arg_1}. {Arg_2}"
    },
    {
      "id": "anax terminating. Failed to instantiate iptables client. {Arg_1}",
      "translation": "anax está finalizando. No se ha podido instanciar cliente de iptables. {Arg_1}"
    },
    {
      "id": "anax terminating. Failed to instantiate docker client. {Arg_1}",
      "translation": "anax está finalizando. No se ha podido instanciar cliente de docker. {Arg_1}"
    },
    {
      "id": "Property {PROPNODEPRIVILEGED} must have a boolean value (true or false).",
      "translation": "La propiedad {PROPNODEPRIVILEGED} debe tener un valor booleano (true o false)."
    },
    {
      "id": "Property must include a name and a value: {Property}",
      "translation": "La propiedad debe incluir un nombre y un valor: {Property}"
    },
    {
      "id": "Property {Name} has invalid property type {DeclaredType}. Allowed property types are: version, string, int, boolean, float, and list of strings.",
      "translation": "La propiedad {Name} tiene un tipo de propiedad no válido {DeclaredType}. Los tipos de propiedad permitidos son: version, string, int, boolean, float y lista de strings."
    },
    {
      "id": "Property value is of type {ActualType}, expected type {DeclaredType}",
      "translation": "El tipo del valor de propiedad es {ActualType}, se esperaba el tipo {DeclaredType}"
    },
    {
      "id": "Value {Value} of property {Name} is not an integer type",
      "translation": "El valor {Value} de la propiedad {Name} no es un tipo entero"
    },
    {
      "id": "Value {Value} of property {Name} is not a valid string. Please define type or change value to a string.",
      "translation": "El valor {Value} de la propiedad {Name} no es una serie válida. Defina el tipo o cambie el valor a una serie."
    },
    {
      "id": "Property {Name} with value {Value} is not a valid verion string",
      "translation": "La propiedad {Name} con el valor {Value} no es una serie de versión válida"
    },
    {
      "id": "Property {Name} has invalid value type {ActualType}",
      "translation": "La propiedad {Name} tiene un tipo de valor no válido {ActualType}"
    },
    {
      "id": "The constraint expression: {Dconstraints} is type {Dconstraints_1}, but is expected to be an array of strings",
      "translation": "La expresión de restricción {Dconstraints} es del tipo {Dconstraints_1}, pero se esperaba que fuera una matriz de series."
    },
    {
      "id": "The constraint expression contains unmatched parentheses.",
      "translation": "La expresión de restricción contiene paréntesis desemparejados."
    },
    {
      "id": "Error retrieving agreement {Arg_1} from database, error {Arg_2}",
      "translation": "Se ha producido un error al recuperar el acuerdo {Arg_1} de la base de datos, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for MeteringNotification message, error {Arg_2}",
      "translation": "No se ha podido recuperar el acuerdo {Arg_1} de la base de datos para el mensaje MeteringNotification, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for Cancel message, error {Arg_2}",
      "translation": "No se ha podido recuperar el acuerdo {Arg_1} de la base de datos para el mensaje Cancel, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for ReplyAck message, error {Arg_2}",
      "translation": "No se ha podido recuperar el acuerdo {Arg_1} de la base de datos para el mensaje ReplyAck, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for DataReceived message, error {Arg_2}",
      "translation": "No se ha podido recuperar el acuerdo {Arg_1} de la base de datos para el mensaje DataReceived, error {Arg_2}"
    },
    {
      "id": "Unable to retrieve unarchived agreements from database. {Arg_1}",
      "translation": "No se pueden recuperar los acuerdos no archivados de la base de datos. {Arg_1}"
    },
    {
      "id": "Error marking agreement {Arg_1} terminated in database: {Arg_2}.",
      "translation": "Se ha producido un error al marcar el acuerdo {Arg_1} como terminado en la base de datos: {Arg_2}."
    },
    {
      "id": "Error getting service definitions {Arg_1} from db. {Arg_2}",
      "translation": "Se ha producido un error al obtener definiciones de servicio {Arg_1} de la base de daos. {Arg_2}"
    },
    {
      "id": "Error retrieving all service definitions from db. {Arg_1}",
      "translation": "Error al recuperar todas las definiciones de servicio de la bd. {Arg_1}"
    },
    {
      "id": "Error retrieving all service instances from database for {Arg_1}/{Arg_2} version {Arg_3} key {Arg_4}. {Arg_5}",
      "translation": "Se ha producido un error al recuperar todas las instancias de servicio de la base de datos para {Arg_1}/{Arg_2} versión {Arg_3} clave {Arg_4}. {Arg_5}"
    },
    {
      "id": "Error retrieving all service instances from database for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al recuperar todas las instancias de servicio de la base de datos para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error retrieving all service instances from database, error: {Arg_1}",
      "translation": "Se ha producido un error al recuperar todas las instancias de servicio de la base de datos, error: {Arg_1}"
    },
    {
      "id": "Error getting service instance {Arg_1} from db. {Arg_2}",
      "translation": "Se ha producido un error al obtener una instancia de servicio {Arg_1} de la base de daos. {Arg_2}"
    },
    {
      "id": "Error retrieving matching agreements from database for workloads {Arg_1}. Error: {Arg_2}",
      "translation": "Se ha producido un error al recuperar acuerdos coincidentes de la base de datos para cargas de trabajo {Arg_1}. Error: {Arg_2}"
    },
    {
      "id": "Error perisisting node config state in database to {Arg_1}. Error: {Arg_2}",
      "translation": "Se ha producido un error al persistir el estado de configuración de nodo en la base de datos a {Arg_1}. Error: {Arg_2}"
    },
    {
      "id": "Error retrieving device from database. Error: {Arg_1}",
      "translation": "Se ha producido un error al recuperar el dispositivo de la base de datos. Error: {Arg_1}"
    },
    {
      "id": "Error deleting node exchange pattern from the local database. {Arg_1}",
      "translation": "Se ha producido un error al suprimir el patrón de Exchange de nodo de la base de datos local. {Arg_1}"
    },
    {
      "id": "Error retrieving node {Arg_1} from the Exchange: {Arg_2}",
      "translation": "Error al recuperar el nodo {Arg_1} de Exchange: {Arg_2}"
    },
    {
      "id": "Error updating registeredServices for node {Arg_1} in the Exchange: {Arg_2}",
      "translation": "Error al actualizar registeredServices para el nodo {Arg_1} en Exchange: {Arg_2}"
    },
    {
      "id": "Image loaded for {Arg_1}/{Arg_2}.",
      "translation": "Se ha cargado la imagen para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Image loaded for service {Arg_1}/{Arg_2}.",
      "translation": "Se ha cargado la imagen para el servicio {Arg_1}/{Arg_2}."
    },
    {
      "id": "Error loading image for {Arg_1}/{Arg_2}. Reason: {Arg_3}",
      "translation": "Se ha producido un error al cargar la imagen para {Arg_1}/{Arg_2}. Razón: {Arg_3}"
    },
    {
      "id": "Error loading image for service {Arg_1}/{Arg_2}.",
      "translation": "Se ha producido un error al cargar la imagen para el servicio {Arg_1}/{Arg_2}."
    },
    {
      "id": "Start terminating agreement for {Arg_1}. Termination reason: {Arg_2}",
      "translation": "Iniciar acuerdo de terminación para {Arg_1}. Razón de terminación: {Arg_2}"
    },
    {
      "id": "Agreement reached for service {Arg_1}. The agreement id is {Arg_2}.",
      "translation": "Se ha alcanzado un acuerdo para el servicio {Arg_1}. El ID del acuerdo es {Arg_2}."
    },
    {
      "id": "Agreement for {Arg_1} no longer valid on the agbot. Node will cancel it.",
      "translation": "El acuerdo para {Arg_1} ya no es válido en el agbot. El nodo lo cancelará."
    },
    {
      "id": "Workload service containers for {Arg_1}/{Arg_2} are up and running.",
      "translation": "Los contenedores de servicio de carga de trabajo para {Arg_1}/{Arg_2} están activos y funcionando."
    },
    {
      "id": "Complete terminating agreement for {Arg_1}. Termination reason: {Arg_2}",
      "translation": "Completar acuerdo de terminación para {Arg_1}. Razón de terminación: {Arg_2}"
    },
    {
      "id": "Error deleting agreement for {Arg_1} in exchange: {Arg_2}. Will retry.",
      "translation": "Se ha producido un error al suprimir el acuerdo para {Arg_1} en Exchange: {Arg_2}. Se volverá a intentar."
    },
    {
      "id": "Encountered error for AgreementVerification for {Arg_1} with agbot, error {Arg_2}",
      "translation": "Se ha encontrado un error para AgreementVerification para {Arg_1} con agbot, error {Arg_2}"
    },
    {
      "id": "ReplyAck indicated that the agbot did not want to pursue the agreement for {Arg_1}. Node will cancel the agreement",
      "translation": "ReplyAck ha indicado que el agbot no quería perseguir el acuerdo para {Arg_1}. El nodo cancelará el acuerdo"
    },
    {
      "id": "Node received Cancel message for {Arg_1}/{Arg_2} from agbot {Arg_3}.",
      "translation": "El nodo ha recibido el mensaje Cancelar para for {Arg_1}/{Arg_2} del agbot {Arg_3}."
    },
    {
      "id": "Error handling ReplyAck message for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al manejar el mensaje ReplyAck para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling ReplyAck message. {Arg_1}",
      "translation": "Se ha producido un error al manejar el mensaje ReplyAck. {Arg_1}"
    },
    {
      "id": "Error handling DataReceived message for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al manejar el mensaje DataReceived para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling DataReceived message. {Arg_1}",
      "translation": "Se ha producido un error al manejar el mensaje DataReceived. {Arg_1}"
    },
    {
      "id": "Error handling MeterNotification message for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al manejar el mensaje MeterNotification para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling MeterNotification message. {Arg_1}",
      "translation": "Se ha producido un error al manejar el mensaje MeterNotification. {Arg_1}"
    },
    {
      "id": "Error handling Cancel message for {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al manejar el mensaje Cancel para {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling Cancel message. {Arg_1}",
      "translation": "Se ha producido un error al manejar el mensaje Cancel. {Arg_1}"
    },
    {
      "id": "Start workload service for {Arg_1}/{Arg_2}.",
      "translation": "Iniciar servicio de carga de trabajo para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Workload destroyed for {Arg_1}",
      "translation": "Se ha destruido la carga de trabajo para {Arg_1}"
    },
    {
      "id": "Service containers for {Arg_1} started.",
      "translation": "Se han iniciado los contenedores de servicio para {Arg_1}."
    },
    {
      "id": "Complete cleaning up the service instance {Arg_1}.",
      "translation": "Completar limpieza de la instancia de servicio {Arg_1}."
    },
    {
      "id": "Start dependent services for {Arg_1}/{Arg_2}.",
      "translation": "Iniciar servicios dependientes para {Arg_1}/{Arg_2}."
    },
    {
      "id": "Encountered error starting dependen services for {Arg_1}/{Arg_2}. {Arg_3}",
      "translation": "Se ha encontrado un error al iniciar los servicios de dependencia para {Arg_1}/{Arg_2}. {Arg_3}"
    },
    {
      "id": "Error starting dependen service {Arg_1}/{Arg_2} version {Arg_3} for agreement {Arg_4}. {Arg_5}",
      "translation": "Se ha producido un error al iniciar el servicio de dependencia {Arg_1}/{Arg_2} versión {Arg_3} para el acuerdo {Arg_4}. {Arg_5}"
    },
    {
      "id": "Start cleaning up service {Arg_1} because agreement {Arg_2} ended.",
      "translation": "Iniciar la limpieza del servicio {Arg_1} porque el acuerdo {Arg_2} ha finalizado."
    },
    {
      "id": "Error starting service {Arg_1}/{Arg_2} version {Arg_3}, error: {Arg_4}",
      "translation": "Se ha producido un error al iniciar el servicio {Arg_1}/{Arg_2} versión{Arg_3}, error: {Arg_4}"
    },
    {
      "id": "Error getting all the services from agreements: {Arg_1}",
      "translation": "Se ha producido un error al obtener todos los servicios de acuerdos: {Arg_1}"
    },
    {
      "id": "Start agreement-less service {Arg_1}/{Arg_2}.",
      "translation": "Iniciar servicio sin acuerdo {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete starting agreement-less service {Arg_1}/{Arg_2} and its dependents.",
      "translation": "Completar el inicio del servicio sin acuerdo {Arg_1}/{Arg_2} y sus dependientes."
    },
    {
      "id": "Unable to start agreement-less service {Arg_1}/{Arg_2}, error {Arg_3}",
      "translation": "No se ha podido iniciar el servicio sin acuerdo {Arg_1}/{Arg_2}, error {Arg_3}"
    },
    {
      "id": "Unable to start agreement-less services, error searching for pattern {Arg_1} in exchange, error: {Arg_2}",
      "translation": "No se han podido iniciar los servicios sin acuerdo, se ha producido un error al buscar el patrón {Arg_1} en Exchange, error: {Arg_2}"
    },
    {
      "id": "Unable to start agreement-less services, pattern {Arg_1} not found in exchange",
      "translation": "No se han podido iniciar los servicios sin acuerdo, el patrón {Arg_1} no se ha encontrado en Exchange"
    },
    {
      "id": "Unable to start agreement-less service {Arg_1}/{Arg_2}, local service definition not found",
      "translation": "No se ha podido iniciar el servicio sin acuerdo {Arg_1}/{Arg_2}, no se ha encontrado la definición de servicio local"
    },
    {
      "id": "Start upgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Iniciar la actualización del servicio {Arg_1}/{Arg_2} de la versión {Arg_3} a la versión {Arg_4}."
    },
    {
      "id": "Complete upgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Completar la actualización del servicio {Arg_1}/{Arg_2} de la versión {Arg_3} a la versión {Arg_4}."
    },
    {
      "id": "Failed to upgrade service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}, error: {Arg_5}",
      "translation": "No se ha podido actualizar el servicio {Arg_1}/{Arg_2} de la versión {Arg_3} a la versión {Arg_4}, error: {Arg_5}"
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because service for agreement failed to start.",
      "translation": "Iniciar la degradación del servicio {Arg_1}/{Arg_2} versión {Arg_3} porque no se ha podido iniciar el servicio para el acuerdo."
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because service failed to start.",
      "translation": "Iniciar la degradación del servicio {Arg_1}/{Arg_2} versión {Arg_3} porque no se ha podido iniciar el servicio."
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because upgrading failed.",
      "translation": "Iniciar la degradación del servicio {Arg_1}/{Arg_2} versión {Arg_3} porque la actualización ha fallado."
    },
    {
      "id": "Failed to downgrade service {Arg_1}/{Arg_2} version {Arg_3}, error: {Arg_4}",
      "translation": "No se ha podido degradar el servicio {Arg_1}/{Arg_2} versión {Arg_3}, error: {Arg_4}"
    },
    {
      "id": "Completed downgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Se ha completado la degradación del servicio {Arg_1}/{Arg_2} de la versión {Arg_3} a la versión {Arg_4}."
    },
    {
      "id": "Error finding the new service definition to downgrade to for {Arg_1}/{Arg_2} version {Arg_3} key {Arg_4}. error: {Arg_5}",
      "translation": "Se ha producido un error al buscar la definición de servicio nueva a la que degradar para {Arg_1}/{Arg_2} versión {Arg_3} clave {Arg_4}. error: {Arg_5}"
    },
    {
      "id": "Could not find lower version to downgrade for {Arg_1}/{Arg_2} version {Arg_3}.",
      "translation": "No se ha podido encontrar una versión más baja a la que degradar para {Arg_1}/{Arg_2} versión {Arg_3}."
    },
    {
      "id": "Error downgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}. Error: {Arg_5}",
      "translation": "Se ha producido un error al degradar el servicio {Arg_1}/{Arg_2} de la versión {Arg_3} a la versión {Arg_4}. Error: {Arg_5}"
    },
    {
      "id": "Error downgrading service {Arg_1}/{Arg_2} version {Arg_3}. {Arg_4}",
      "translation": "Se ha producido un error al degradar el servicio {Arg_1}/{Arg_2} versión {Arg_3}. {Arg_4}"
    },
    {
      "id": "Start retrying number {Arg_1} for dependent service {Arg_2} version {Arg_3} because service failed.",
      "translation": "Iniciar reintento número {Arg_1} para el servicio dependiente {Arg_2} versión {Arg_3} porque el servicio ha fallado."
    },
    {
      "id": "Failed retrying number {Arg_1} for dependent service {Arg_2} version {Arg_3}.",
      "translation": "El reintento número {Arg_1} ha fallado para el servicio dependiente {Arg_2} versión {Arg_3}."
    },
    {
      "id": "Failed to get the service retry count for {Arg_1} version {Arg_2}. {Arg_3}",
      "translation": "No se ha podido obtener el recuento de reintentos de servicio para {Arg_1} versión {Arg_2}. {Arg_3}"
    },
    {
      "id": "Error updating retry start state for service instance {Arg_1} in dadabase. {Arg_2}",
      "translation": "Se ha producido un error al actualizar el estado de reintento para la instancia de servicio {Arg_1} en la base de datos. {Arg_2}"
    },
    {
      "id": "Node pattern changed on the Exchange from {Arg_1} to {Arg_2}.",
      "translation": "El patrón de nodo ha cambiado en Exchange de {Arg_1} a {Arg_2}."
    },
    {
      "id": "Encountered error while re-registering node with new pattern {Arg_1}. {Arg_2}",
      "translation": "Se ha producido un error al volver a registrar el nodo con el patrón nuevo {Arg_1}. {Arg_2}"
    },
    {
      "id": "Start re-registering node after pattern changed to {Arg_1}.",
      "translation": "Iniciar el nuevo registro de nodo después de que el patrón haya cambiado a {Arg_1}."
    },
    {
      "id": "Complete re-registering node after pattern changed to {Arg_1}.",
      "translation": "Completar el nuevo registro de nodo después de que el patrón haya cambiado a {Arg_1}."
    },
    {
      "id": "Node pattern changed again on the Exchange. Will register the node with the new pattern: {Arg_1}",
      "translation": "El patrón de nodo ha cambiado de nuevo en Exchange. Se registrará el nodo con el patrón nuevo: {Arg_1}"
    },
    {
      "id": "Error validating new node pattern {Arg_1}: {Arg_2}",
      "translation": "Se ha producido un error al validar el patrón de nodo nuevo {Arg_1}: {Arg_2}"
    },
    {
      "id": "The node will keep using the old pattern {Arg_1}",
      "translation": "El nodo seguirá utilizando el patrón antiguo {Arg_1}"
    },
    {
      "id": "New pattern {Arg_1} is verified. Will cancel agreements and re-register the node with the new pattern.",
      "translation": "Se ha verificado el patrón nuevo {Arg_1}. Se cancelarán los acuerdos y se volverá a registrar el nodo con el patrón nuevo."
    },
    {
      "id": "Compatibility Error: Schema versions are not the same, Consumer policy: {Version}, Producer policy {Version_1}",
      "translation": "Error de compatibilidad: las versiones de esquema no son iguales, política de consumidor: {Version}, política de productor {Version_1}"
    },
    {
      "id": "Compatibility Error: Node properties {Properties} do not satisfy constraint requirements {Constraints}. Underlying error: {Err}",
      "translation": "Error de compatibilidad: las propiedades de nodo {Properties} no satisfacen los requisitos de la restricción {Constraints}. Error subyacente: {Err}"
    },
    {
      "id": "Compatibility Error: Node properties do not satisfy constraint requirements. {Err}",
      "translation": "Error de compatibilidad: las propiedades de nodo no satisfacen los requisitos de la restricción. {Err}"
    },
    {
      "id": "Compatibility Error: Properties {Properties} do not satisfy Node constraint  {Constraints}. Underlying error: {Err}",
      "translation": "Error de compatibilidad: las propiedades {Properties} no satisfacen la restricción de nodo {Constraints}. Error subyacente: {Err}"
    },
    {
      "id": "Compatibility Error: Properties do not satisfy node constraint. {Err}",
      "translation": "Error de compatibilidad: las propiedades no satisfacen la restricción de nodo. {Err}"
    },
    {
      "id": "Compatibility Error: No common Agreement Protocols between {AgreementProtocols} and {AgreementProtocols_1}. Underlying error: {Err}",
      "translation": "Error de compatibilidad: no hay protocolos de acuerdo comunes entre {AgreementProtocols} y {AgreementProtocols_1}. Error subyacente: {Err}"
    },
    {
      "id": "Compatibility Error: Data verification must be compatible, producer has {DataVerify} and consumer has {DataVerify_1}.",
      "translation": "Error de compatibilidad: la verificación de datos debe ser compatible, el productor tiene {DataVerify} y el consumidor tiene {DataVerify_1}."
    },
    {
      "id": "Agreement {Arg_1} already exists, ignoring proposal: {Arg_2}",
      "translation": "El acuerdo {Arg_1} ya existe, se ignora la propuesta: {Arg_2}"
    },
    {
      "id": "received error demarshalling TsAndCs for agrement {Arg_1}, {Arg_2}",
      "translation": "Se ha recibido un error al desordenar TsAndCs para el acuerdo {Arg_1}, {Arg_2}"
    },
    {
      "id": "Node received Proposal message using agreement {Arg_1} for service {Arg_2}/{Arg_3} from the agbot {Arg_4}.",
      "translation": "El nodo ha recibido un mensaje de propuesta mediante el acuerdo {Arg_1} para el servicio {Arg_2}/{Arg_3} del agbot {Arg_4}."
    },
    {
      "id": "Node rejected the proposal for service {Arg_1}/{Arg_2}.",
      "translation": "El nodo ha rechazado la propuesta para el servicio {Arg_1}/{Arg_2}."
    },
    {
      "id": "Error handling proposal for service {Arg_1}/{Arg_2}. Error: {Arg_3}",
      "translation": "Se ha producido un error al manejar la propuesta para el servicio {Arg_1}/{Arg_2}. Error: {Arg_3}"
    },
    {
      "id": "unable to make directory for self signed MMS API certificate, error {Err}",
      "translation": "No se ha podido crear el directorio para el certificado de la API MMS autofirmado, error {Err}"
    },
    {
      "id": "unable to generate random number for MMS API certificate serial number, error {Err}",
      "translation": "No se ha podido generar un número aleatorio para el número de serie de certificado de la API MMS, error {Err}"
    },
    {
      "id": "unable to generate private key for MMS API certificate, error {Err}",
      "translation": "No se ha podido generar la clave privada para el certificado de la API MMS, error {Err}"
    },
    {
      "id": "unable to create MMS API certificate, error {Err}",
      "translation": "No se ha podido crear el certificado de la API MMS, error {Err}"
    },
    {
      "id": "unable to write MMS API certificate to file {ServerCertificate}, error {Err}",
      "translation": "No se ha podido escribir el certificado de la API MMS en el archivo {ServerCertificate}, error {Err}"
    },
    {
      "id": "unable to encode MMS API certificate to file {ServerCertificate}, error {Err}",
      "translation": "No se ha podido codificar el certificado de la API MMS en el archivo {ServerCertificate}, error {Err}"
    },
    {
      "id": "unable to close MMS API certificate file {ServerCertificate}, error {Err}",
      "translation": "No se ha podido cerrar el archivo de certificado de la API MMS {ServerCertificate}, error {Err}"
    },
    {
      "id": "unable to write MMS API certificate private key to file {ServerKey}, error {Err}",
      "translation": "No se ha podido escribir la clave privada de certificado de la API MMS en el archivo {ServerKey}, error {Err}"
    },
    {
      "id": "unable to encode MMS API certificate private key to file {ServerKey}, error {Err}",
      "translation": "No se ha podido codificar la clave privada de certificado de la API MMS en el archivo {ServerKey}, error {Err}"
    },
    {
      "id": "unable to close MMS API certificate private key file {ServerKey}, error {Err}",
      "translation": "No se ha podido cerrar el archivo de clave privada de certificado de la API MMS {ServerKey}, error {Err}"
    },
    {
      "id": "Unable to authenticate nil request for secrets API",
      "translation": "No se ha podido autenticar la solicitud nula para la API de secretos"
    },
    {
      "id": "Unable to extract basic auth for request",
      "translation": "No se ha podido extraer la autorización básica para la solicitud"
    },
    {
      "id": "unable to verify {AppKey}, error {Err}",
      "translation": "No se ha podido verificar {AppKey}, error {Err}"
    },
    {
      "id": "credentials for {AppKey} are not valid",
      "translation": "las credenciales para {AppKey} no son válidas"
    },
    {
      "id": "Version_Expression: Empty string is not a valid version.",
      "translation": "Version_Expression: la serie vacía no es una versión válida."
    },
    {
      "id": "Version_Expression: Whitespace is not permitted in {Expr}.",
      "translation": "Version_Expression: El espacio en blanco no está permitido en {Expr}."
    },
    {
      "id": "Version_Expression: {Verstring} is not a valid version string.",
      "translation": "Version_Expression: {Verstring} no es una serie de versión válida."
    },
    {
      "id": "Version_Expression: {Verstring} does not begin with an inclusion or exclusion directive.",
      "translation": "Version_Expression: {Verstring} no empieza con una directiva de inclusión o exclusión."
    },
    {
      "id": "Version_Expression: {Verstring} does not end with an inclusion or exclusion directive.",
      "translation": "Version_Expression: {Verstring} no termina con una directiva de inclusión o exclusión."
    },
    {
      "id": "Version_Expression: Incorrect number of versions in expression: {Expr}.",
      "translation": "Version_Expression: Número incorrecto de versiones en la expresión: {Expr}."
    },
    {
      "id": "Input version string {V1} or {V2} is not a valid single version string.",
      "translation": "La serie de versión de entrada {V1} o {V2} no es una serie de versión única válida."
    }
  ]
}
