// NLS_CHARSET=UTF-8
{
  "language": "fr",
  "messages": [
    {
      "id": "Unable to read policy file {Arg_1} for service {Arg_2}, error: {Arg_3}",
      "translation": "Impossible de lire le fichier de règles {Arg_1} pour le service {Arg_2}, erreur : {Arg_3}"
    },
    {
      "id": "Start policy advertising with the Exchange for service {Arg_1}/{Arg_2}.",
      "translation": "Démarre la publicité des règles avec Exchange pour le service {Arg_1}/{Arg_2}."
    },
    {
      "id": "Unable to advertise policies with Exchange for service {Arg_1}/{Arg_2}, error: {Arg_3}",
      "translation": "Impossible de faire la publicité des règles avec Exchange pour le service {Arg_1}/{Arg_2}, erreur : {Arg_3}"
    },
    {
      "id": "Complete policy advertising with the Exchange for service {Arg_1}/{Arg_2}.",
      "translation": "Termine la publicité des règles avec Exchange pour le service {Arg_1}/{Arg_2}."
    },
    {
      "id": "unable to read node policy from the local database. {Arg_1}",
      "translation": "impossible de lire la règle du noeud à partir de la base de données locale. {Arg_1}"
    },
    {
      "id": "Unable to read node object from the local database. {Arg_1}",
      "translation": "Impossible de lire l'objet du noeud à partir de la base de données locale. {Arg_1}"
    },
    {
      "id": "Unable to sync the local node policy with the Exchange copy. Error: {Arg_1}",
      "translation": "Impossible de synchroniser la règle du noeud local avec la copie d'Exchange. Erreur : {Arg_1}"
    },
    {
      "id": "Node policy updated with the Exchange copy: {Arg_1}",
      "translation": "Mise à jour de la règle du noeud avec la copie d'Exchange : {Arg_1}"
    },
    {
      "id": "Unable to sync the local node user input with the Exchange copy. Error: {Arg_1}",
      "translation": "Impossible de synchroniser l'entrée utilisateur du noeud local avec la copie d'Exchange. Erreur : {Arg_1}"
    },
    {
      "id": "Node user input updated with the Exchange copy. The changed user inputs are: {Arg_1}",
      "translation": "Mise à jour de l'entrée utilisateur du noeud avec la copie d'Exchange. Les entrées utilisateur modifiées sont les suivantes : {Arg_1}"
    },
    {
      "id": "Node could not verify the agreement {Arg_1} with the consumer. Will cancel it",
      "translation": "Le noeud n'a pas pu vérifier l'accord {Arg_1} auprès du consommateur. Il sera annulé."
    },
    {
      "id": "Node is offline. Logging of periodic offline error messages will be curtailed until connection is restored",
      "translation": "Le noeud est hors ligne. La consignation de messages d'erreur périodiques sera limitée tant que la connexion n'est pas rétablie."
    },
    {
      "id": "Unable to sync the node with the Exchange copy. Error: {Arg_1}",
      "translation": "Impossible de synchroniser le noeud avec la copie d'Exchange. Erreur : {Arg_1}"
    },
    {
      "id": "Unable to retrieve the service configuration state for node resource {Arg_1} from the Exchange, error {Arg_2}",
      "translation": "Impossible de récupérer l'état de configuration du service pour la ressource de noeud {Arg_1} à partir d'Exchange. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve the saved node exchange pattern from the local database. {Arg_1}",
      "translation": "Impossible de récupérer pattern Exchange de noeud sauvegardé à partir de la base de données locale. {Arg_1}"
    },
    {
      "id": "Unable to save the new node exchange pattern {Arg_1} to the local database. Error: {Arg_2}",
      "translation": "Impossible de sauvegarder le nouveau pattern Exchange de noeud {Arg_1} dans la base de données locale. Erreur : {Arg_2}"
    },
    {
      "id": "anax terminating, unable to sync up containers.",
      "translation": "Anax en cours d'arrêt. Impossible de synchroniser les conteneurs."
    },
    {
      "id": "anax terminating, unable to complete agreement sync up. {Arg_1}",
      "translation": "Anax est en cours d'arrêt. Impossible de terminer la synchronisation de l'accord. {Arg_1}"
    },
    {
      "id": "No input found.",
      "translation": "Aucune entrée trouvée."
    },
    {
      "id": "Unauthorized. No exchange user id is supplied.",
      "translation": "Non autorisé. Aucun ID utilisateur Exchange n'est fourni."
    },
    {
      "id": "Failed to authenticate the user with the Exchange. {Err}",
      "translation": "Echec d'authentification de l'utilisateur avec Exchange. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to JSON object. {Err}",
      "translation": "Impossible de désérialiser le corps de l'entrée en objet JSON. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to PolicyCheck object. {Err}",
      "translation": "Impossible de désérialiser le corps de l'entrée en objet PolicyCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to UserInputCheck object. {Err}",
      "translation": "Impossible de désérialiser le corps de l'entrée en objet UserInputCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to SecretBindingCheck object. {Err}",
      "translation": "Le corps de l'entrée n'a pas pu être désérialisé en objet SecretBindingCheck. {Err}"
    },
    {
      "id": "Input body couldn't be deserialized to CompCheck object. {Err}",
      "translation": "Impossible de désérialiser le corps de l'entrée en objet CompCheck. {Err}"
    },
    {
      "id": "No exchange user id is supplied.",
      "translation": "Aucun ID utilisateur Exchange n'est fourni."
    },
    {
      "id": "No exchange user organization id is supplied.",
      "translation": "Aucun ID organisation d'utilisateur Exchange n'est fourni."
    },
    {
      "id": "No exchange user password or api key is supplied.",
      "translation": "Aucun mot de passe utilisateur Exchange ni aucune clé d'API n'est fourni."
    },
    {
      "id": "Wrong organization id, user id or password.",
      "translation": "Mauvais ID organisation, ID utilisateur ou de mot de passe."
    },
    {
      "id": "Exchange user {Key} is not in the correct format, should be org/username.",
      "translation": "L'utilisateur Exchange {Key} n'est pas au format correct, il doit être org/nom_utilisateur."
    },
    {
      "id": "Internal server error",
      "translation": "Erreur de serveur interne"
    },
    {
      "id": "There is no secrets provider configured, secrets are unavailable.",
      "translation": "Aucun fournisseur de secrets n'est configuré ; les secrets ne sont pas disponibles."
    },
    {
      "id": "The secrets provider is not ready. The caller should retry this API call a small number of times with a short delay between calls to ensure that the secrets provider is unavailable.",
      "translation": "Le fournisseur de secrets n'est pas prêt. L'appelant doit relancer cet appel d'API à quelques reprises avec un court délai entre les appels afin de s'assurer que le fournisseur de secrets n'est pas disponible."
    },
    {
      "id": "Secret name must be provided",
      "translation": "Le nom de secret doit être fourni"
    },
    {
      "id": "Unable to read request body, error: {Err}.",
      "translation": "Impossible de lire le corps de la demande, erreur : {Err}."
    },
    {
      "id": "Request body is empty.",
      "translation": "Le corps de demande est vide."
    },
    {
      "id": "Request body parse error, {Uerr}",
      "translation": "Erreur d'analyse du corps de la demande, {Uerr}"
    },
    {
      "id": "Permission denied, user \"{ExUser}\" cannot {Action} secrets in organization \"{Org}\"",
      "translation": "Autorisation refusée, utilisateur \"{ExUser}\" ne peut pas {Action} secrets dans l'organisation \"{Org}\""
    },
    {
      "id": "Permission denied, user \"{ExUser}\" cannot {Action} secret \"{SecretName}\" in organization \"{Org}\"",
      "translation": "Autorisation refusée, utilisateur \"{ExUser}\" ne peut pas {Action} secret  \"{SecretName}\" dans l'organisation \"{Org}\""
    },
    {
      "id": "Unable to read the vault response: {Error}",
      "translation": "Impossible de lire la réponse du coffre : {Error}"
    },
    {
      "id": "Unable to parse the vault response \"{Response}\": {Error}",
      "translation": "Impossible d'analyser la réponse du coffre \"{Response}\": {Error}"
    },
    {
      "id": "Unable to {Action} secrets in organization \"{Org}\", operation not supported by the secrets provider.",
      "translation": "Impossible de {Action} secrets dans l'organisation \"{Org}\", opération non prise en charge par le fournisseur de secrets."
    },
    {
      "id": "Unable to {Action} secret \"{SecretName}\" in organization \"{Org}\", operation not supported by the secrets provider.",
      "translation": "Impossible de {Action} secret \"{SecretName}\" dans l'organisation \"{Org}\", opération non prise en charge par le fournisseur de secrets."
    },
    {
      "id": "Secrets provider received a bad request, please check all the provided inputs.",
      "translation": "Le fournisseur de secrets a reçu une demande incorrecte, veuillez cocher toutes les entrées fournies."
    },
    {
      "id": "Response: {Response}",
      "translation": "Réponse : {Response}"
    },
    {
      "id": "No secret(s) found in organization \"{Org}\"",
      "translation": "Aucun secret trouvé dans l'organisation \"{Org}\""
    },
    {
      "id": "No secret(s) found under secret name \"{SecretName}\"",
      "translation": "Aucun secret trouvé sous le nom secret \"{SecretName}\""
    },
    {
      "id": "An unknown error occurred. Response code {ResponseCode} received from the secrets provider.",
      "translation": "Une erreur inconnue est survenue. Code de réponse {ResponseCode} reçu du fournisseur de secrets."
    },
    {
      "id": "Organization must be specified in the API path",
      "translation": "L'organisation doit être spécifiée dans le chemin d'API"
    },
    {
      "id": "User must be specified in the API path",
      "translation": "L'utilisateur doit être spécifié dans le chemin d'API"
    },
    {
      "id": "Error checking secret {FullSecretName} in the secret manager.",
      "translation": "Erreur lors de la vérification du secret {FullSecretName} dans le gestionnaire de secrets."
    },
    {
      "id": "Wrong type returned checking the secret name in the secret manager: {Payload}",
      "translation": "Type incorrect renvoyé lors de la vérification du nom de secret dans le gestionnaire de secrets : {Payload}"
    },
    {
      "id": "Secret {FullSecretName} does not exist in the secret manager.",
      "translation": "Le secret {FullSecretName} n'existe pas dans le gestionnaire de secrets."
    },
    {
      "id": "Error parsing the selections {Form}. {Err}",
      "translation": "Erreur lors de l'analyse syntaxique des sélections {Form}. {Err}"
    },
    {
      "id": "Error getting {Resource} for output, error {Err}",
      "translation": "Erreur lors de l'obtention de {Resource} pour la sortie. Erreur {Err}"
    },
    {
      "id": "Error parsing input for node configuration/registration. Input body couldn't be deserialized to node object: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour la configuration/l'enregistrement du noeud. Le corps de l'entrée n'a pas pu être désérialisé en objet noeud {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node configuration/registration. Input body couldn't be deserialized to configstate object: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour la configuration/l'enregistrement du noeud. Le corps de l'entrée n'a pas pu être désérialisé en objet configstate {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node update. Input body couldn't be deserialized to node object: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour la mise à jour du noeud. Le corps de l'entrée n'a pas pu être désérialisé en objet noeud {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy. Input body could not be deserialized as a policy object: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour la règle du noeud. Le corps de l'entrée n'a pas pu être désérialisé en tant qu'objet de règle {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy patch. Input body could not be deserialized into a Constraint Expression or Property List: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour le correctif de la règle du noeud. Le corps de l'entrée n'a pas pu être désérialisé dans une expression de contrainte ou une liste de propriétés {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node policy patch. Input body did not contain a Constraint Expression or Property List: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée pour le correctif de la règle du noeud. Le corps de l'entrée ne comportait pas d'expression de contrainte ni de liste de propriétés {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error parsing input for node user input. Input body could not be deserialized as a UserInput object: {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de l'analyse syntaxique de l'entrée utilisateur du noeud. Le corps de l'entrée n'a pas pu être désérialisé en tant qu'objet UserInput {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Error in node configuration/registration for node {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de la configuration/l'enregistrement du noeud {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error in updating node {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de la mise à jour du noeud {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error in node unregistration. {Arg_1}",
      "translation": "Erreur lors de l'annulation de l'enregistrement du noeud. {Arg_1}"
    },
    {
      "id": "Error verifiying exchange version. error: {Arg_1}",
      "translation": "Erreur lors de la vérification de la version d'Exchange. Erreur : {Arg_1}"
    },
    {
      "id": "Error in creating or replacing node policy. {Arg_1}",
      "translation": "Erreur lors de la création ou du remplacement de la règle du noeud. {Arg_1}"
    },
    {
      "id": "Error in patching node policy. {Arg_1}",
      "translation": "Erreur lors de la correction de la règle du noeud. {Arg_1}"
    },
    {
      "id": "Error in deleting node policy. {Arg_1}",
      "translation": "Erreur lors de la suppression de la règle du noeud. {Arg_1}"
    },
    {
      "id": "Error in updating node user input. {Arg_1}",
      "translation": "Erreur lors de la mise à jour de l'entrée utilisateur du noeud. {Arg_1}"
    },
    {
      "id": "Error in patching node user input. {Arg_1}",
      "translation": "Erreur lors de la correction de l'entrée utilisateur du noeud. {Arg_1}"
    },
    {
      "id": "Error in deleting node userinput. {Arg_1}",
      "translation": "Erreur lors de la suppression de l'entrée utilisateur du noeud. {Arg_1}"
    },
    {
      "id": "Start node configuration/registration for node {Arg_1}.",
      "translation": "Démarrage de la configuration/l'enregistrement du noeud {Arg_1}."
    },
    {
      "id": "Start updating node {Arg_1}.",
      "translation": "Démarrage de la mise à jour du noeud {Arg_1}."
    },
    {
      "id": "Complete node update for {Arg_1}.",
      "translation": "Fin de la mise à jour du noeud pour {Arg_1}."
    },
    {
      "id": "Start node unregistration.",
      "translation": "Démarrage de l'annulation de l'enregistrement du noeud."
    },
    {
      "id": "Node unregistration complete for node {Arg_1}.",
      "translation": "Fin de l'annulation de l'enregistrement du noeud {Arg_1}."
    },
    {
      "id": "Error unregistering the node. The node is not found from the database.",
      "translation": "Erreur lors de l'annulation de l'enregistrement du noeud. Le noeud est introuvable dans la base de données."
    },
    {
      "id": "Error unregistering the node. The node must be in 'configured' or 'configuring' state in order to unconfigure it.",
      "translation": "Erreur lors de l'annulation de l'enregistrement du noeud. Le noeud doit être à l'état 'configuré' ou 'en cours de configuration' pour pouvoir annuler sa configuration."
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for removeNode",
      "translation": "Erreur d'entrée pour l'annulation d'enregistrement du noeud. {Arg_1} est une valeur incorrecte pour removeNode"
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for deepClean",
      "translation": "Erreur d'entrée pour l'annulation d'enregistrement du noeud. {Arg_1} est une valeur incorrecte pour deepClean"
    },
    {
      "id": "Input error for node unregistration. {Arg_1} is an incorrect value for block",
      "translation": "Erreur d'entrée pour l'annulation d'enregistrement du noeud. {Arg_1} est une valeur incorrecte pour block"
    },
    {
      "id": "Unable to read node object from database, error {Arg_1}",
      "translation": "Impossible de lire un objet du noeud à partir de la base de données. Erreur {Arg_1}"
    },
    {
      "id": "Error saving new node config state (unconfiguring) in the database: {Arg_1}",
      "translation": "Erreur lors de la sauvegarde d'un nouvel état de configuration du noeud (unconfiguring) dans la base de données {Arg_1}"
    },
    {
      "id": "Error in node configuration. The node is not found from the database.",
      "translation": "Erreur lors de la configuration du noeud. Le noeud est introuvable dans la base de données."
    },
    {
      "id": "Error in node configuration. The node must be in 'configured' or 'configuring' state in order to change the state to {Arg_1}.",
      "translation": "Erreur lors de la configuration du noeud. Le noeud doit être à l'état 'configuré' ou 'en cours de configuration' pour pouvoir modifier son état en {Arg_1}."
    },
    {
      "id": "Node state transition from '{Arg_1}' to '{Arg_2}' is not supported.",
      "translation": "La transition d'état de noeud de '{Arg_1}' vers '{Arg_2}' n'est pas prise en charge."
    },
    {
      "id": "Failed get user input from local db. {Arg_1}",
      "translation": "Impossible d'obtenir l'entrée utilisateur à partir de la base de données locale. {Arg_1}"
    },
    {
      "id": "Failed to find preferences for service {Arg_1}/{Arg_2} from the local user input, error: {Arg_3}",
      "translation": "Impossible de trouver les préférences du service {Arg_1}/{Arg_2} à partir de l'entrée utilisateur locale. Erreur {Arg_3}"
    },
    {
      "id": "Error saving new node config state to database: {Arg_1}",
      "translation": "Erreur lors de la sauvegarde d'un nouvel état de configuration du noeud dans la base de données {Arg_1}"
    },
    {
      "id": "Complete node configuration/registration for node {Arg_1}.",
      "translation": "Fin de la configuration/l'enregistrement du noeud {Arg_1}."
    },
    {
      "id": "Error in service configuration for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de la configuration du service pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error getting service references for pattern {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de l'obtention des références du service pour le pattern {Arg_1}. {Arg_2}"
    },
    {
      "id": "Ignoring service. {Arg_1}",
      "translation": "Le service est ignoré. {Arg_1}"
    },
    {
      "id": "New node policy: {Arg_1}",
      "translation": "Nouvelle règle de noeud : {Arg_1}"
    },
    {
      "id": "Deleted node policy",
      "translation": "Règle de noeud supprimée"
    },
    {
      "id": "New node user input: {Arg_1}",
      "translation": "Nouvelle entrée utilisateur du noeud : {Arg_1}"
    },
    {
      "id": "No node user input to detele",
      "translation": "Aucune entrée utilisateur du noeud à supprimer"
    },
    {
      "id": "Deleted all node user input",
      "translation": "Entrées utilisateur de noeud supprimées"
    },
    {
      "id": "Start service configuration with user input for {Arg_1}/{Arg_2}.",
      "translation": "Démarrage de la configuration du service à l'aide de l'entrée utilisateur pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Start service auto configuration for {Arg_1}/{Arg_2}.",
      "translation": "Démarrage de la configuration automatique du service pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete service configuration for {Arg_1}/{Arg_2}.",
      "translation": "Fin de la configuration du service pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete service auto configuration for {Arg_1}/{Arg_2}.",
      "translation": "Fin de la configuration automatique du service pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Variable {Arg_1} is missing in the service configuration for {Arg_2}/{Arg_3}. It may prevent an agreement if the deployment policy does not contain the setting for the missing variable.",
      "translation": "La variable {Arg_1} est manquante dans la configuration du service pour {Arg_2}/{Arg_3}. Cela peut empêcher qu'un accord soit trouvé si la règle de déploiement ne comporte pas le paramètre de la variable manquante."
    },
    {
      "id": "Error configuring service {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de la configuration du service {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error changing service configstate {Arg_1}, error {Arg_2}",
      "translation": "Erreur lors du changement d'état de la configuration du service {Arg_1}. Erreur {Arg_2}"
    },
    {
      "id": "Start changing service configuration state to {Arg_1} for {Arg_2} for the node.",
      "translation": "Démarrage du changement d'état de configuration du service de {Arg_1} en {Arg_2} pour le noeud."
    },
    {
      "id": "Complete changing service configuration state to {Arg_1} for {Arg_2} for the node.",
      "translation": "Fin de changement d'état de configuration du service de {Arg_1} en {Arg_2} pour le noeud."
    },
    {
      "id": "Error converting the selections into Selectors: {Err}",
      "translation": "Erreur lors de la conversion des sélections en sélecteurs : {Err}"
    },
    {
      "id": "Name, or Org is empty string.",
      "translation": "La chaîne Name ou Org est vide."
    },
    {
      "id": "The serviceVersions array is empty.",
      "translation": "Le tableau serviceVersions est vide."
    },
    {
      "id": "properties contains an invalid property: {Err}",
      "translation": "Les propriétés comportent une propriété non valide : {Err}"
    },
    {
      "id": "The property {PROPSVCPRIVILEGED} must have a boolean value (true or false).",
      "translation": "La propriété {PROPSVCPRIVILEGED} doit avoir une valeur booléenne (true ou false)."
    },
    {
      "id": "Node heartbeat failed for node {Arg_1}/{Arg_2}. Error: {Arg_3}",
      "translation": "Echec de signal de présence du noeud {Arg_1}/{Arg_2}. Erreur : {Arg_3}"
    },
    {
      "id": "Node heartbeat restored for node {Arg_1}/{Arg_2}.",
      "translation": "Restauration du signal de présence du noeud {Arg_1}/{Arg_2}."
    },
    {
      "id": "[verbose] {M}",
      "translation": "[prolixe] {M}"
    },
    {
      "id": "Error: {Msg}",
      "translation": "Erreur : {Msg}"
    },
    {
      "id": "Warning: {Msg}",
      "translation": "Avertissement : {Msg}"
    },
    {
      "id": "failed to unmarshal bytes from {ErrMsg}: {Err}",
      "translation": "Echec de désérialisation des octets à partir de {ErrMsg} : {Err}"
    },
    {
      "id": "failed to marshal data type from {ErrMsg}: {Err}",
      "translation": "Echec de sérialisation du type de données à partir de {ErrMsg} : {Err}"
    },
    {
      "id": "problem testing api key match: {Err}",
      "translation": "Problème lors du test de correspondance des clés d'API : {Err}"
    },
    {
      "id": "Using API key",
      "translation": "Utilisation d'une clé d'API"
    },
    {
      "id": "unable to create docker client: {Err}",
      "translation": "Impossible de créer le client Docker : {Err}"
    },
    {
      "id": "docker auth domainName: {DomainName}",
      "translation": "Nom de domaine d'autorisation Docker : {DomainName}"
    },
    {
      "id": "unable to load docker credentials for {Domain}: {Err}",
      "translation": "impossible de charger les données d'identification Docker pour {Domain} : {Err}"
    },
    {
      "id": "unable to find docker credentials for {Domain}",
      "translation": "Impossible de trouver les données d'identification Docker pour {Domain}"
    },
    {
      "id": "Pushing {ImageName}...",
      "translation": "Envoi en cours : {ImageName}..."
    },
    {
      "id": "could not get docker credentials from ~/.docker/config.json: {Err}. Maybe you need to run 'docker login ...' to provide credentials for the image registry.",
      "translation": "Impossible d'obtenir les données d'identification Docker à partir de ~/.docker/config.json : {Err}. Vous devrez peut-être exécuter 'docker login...' pour fournir les données d'identification du registre d'image."
    },
    {
      "id": "unable to push docker image {Repository____tag}: {Err}",
      "translation": "Impossible d'envoyer par commande push l'image Docker {Repository____tag} : {Err}"
    },
    {
      "id": "Pulling {ImageName}...",
      "translation": "Extraction en cours : {ImageName}..."
    },
    {
      "id": "unable to get docker auth for docker.io or {Domain} domain: {Err}",
      "translation": "impossible d'obtenir l'authentification Docker pour le domaine {Domain} ou docker.io : {Err}"
    },
    {
      "id": "unable to pull docker image {Repository____tag}. Docker credentials were not found. Maybe you need to run 'docker login ...' if the image registry is private. Error: {Err}: {LoginErr}",
      "translation": "Impossible d'extraire par commande pull l'image Docker {Repository____tag}. Les données d'identification n'ont pas été trouvées. Vous devrez peut-être exécuter 'docker login...' si le registre d'images est privé. Erreur : {Err} : {LoginErr}"
    },
    {
      "id": "unable to pull docker image {Repository____tag}: {Err}",
      "translation": "Impossible d'extraire par commande pull l'image Docker {Repository____tag} : {Err}"
    },
    {
      "id": "Could not find the image digest in the docker output, retrieving image digest directly from the image.",
      "translation": "Historique de l'image introuvable dans la sortie Docker, extraction de l'historique directement depuis l'image."
    },
    {
      "id": "could not inspect image {ImageName}: {Err}.",
      "translation": "Impossible d'inspecter l'image {ImageName} : {Err}."
    },
    {
      "id": "could not find digest for image {ImageName}.",
      "translation": "Historique introuvable pour l'image {ImageName}."
    },
    {
      "id": "the id can not contain more than 1 '/'",
      "translation": "L'ID ne doit pas contenir plus de 1 '/'"
    },
    {
      "id": "reading stdin failed: {Err}",
      "translation": "Echec de lecture de stdin : {Err}"
    },
    {
      "id": "reading {FilePath} failed: {Err}",
      "translation": "Echec de lecture {FilePath} : {Err}"
    },
    {
      "id": "Warning: environment variable '{EnvVarName}' is referenced in input file, but not defined in the environment.",
      "translation": "Avertissement : La variable d'environnement '{EnvVarName}' est référencée dans le fichier d'entrée, mais elle n'est pas définie dans l'environnement."
    },
    {
      "id": "Error reading input, error {Err}",
      "translation": "Erreur lors de la lecture de l'entrée, erreur {Err}"
    },
    {
      "id": "Exiting.",
      "translation": "Sortie."
    },
    {
      "id": "Failed to get absolute path for file {KeyFile}. {Err}",
      "translation": "Echec d'obtention du chemin d'accès absolu pour le fichier {KeyFile}. {Err}"
    },
    {
      "id": "Error parsing HORIZON_URL: {Err}",
      "translation": "Erreur lors de l'analyse syntaxique de HORIZON_URL : {Err}"
    },
    {
      "id": "Error parsing host of the HORIZON_URL: {Err}",
      "translation": "Erreur lors de l'analyse syntaxique de l'hôte de HORIZON_URL : {Err}"
    },
    {
      "id": "Error parsing port of the HORIZON_URL: {Err}",
      "translation": "Erreur lors de l'analyse syntaxique du port de HORIZON_URL : {Err}"
    },
    {
      "id": "Unexpected port of the HORIZON_URL: {PortInt}",
      "translation": "Port inattendu de HORIZON_URL : {PortInt}"
    },
    {
      "id": "The agbot url: {EnvVar}",
      "translation": "L'URL agbot {EnvVar}"
    },
    {
      "id": "Error reading HTTP response, error {Err}",
      "translation": "Erreur lors de la lecture de la réponse HTTP, erreur {Err}"
    },
    {
      "id": "Can't connect to the Horizon REST API to run {ApiMethod}. Run '{StatusCommand}' to check if the Horizon agent is running. Or run '{StatusURL}' to check the Horizon agent status. Or set HORIZON_URL to connect to another local port that is connected to a remote Horizon agent via a ssh tunnel. Specific error is: {Err}",
      "translation": "Connexion impossible à l'API REST Horizon pour exécuter {ApiMethod}. Exécutez '{StatusCommand}' pour vérifier si l'agent Horizon est en cours d'exécution. Ou exécutez '{StatusURL}' pour vérifier le statut de l'agent Horizon. Vous pouvez également définir la variable HORIZON_URL afin de vous connecter à un autre port local qui est connecté à un agent Horizon distant via un tunnel SSH. Erreur spécifique : {Err}"
    },
    {
      "id": "Can't connect to the Horizon REST API to run {ApiMethod}. Maybe the ssh tunnel associated with that port is down? Or maybe the remote Horizon agent at the other end of that tunnel is down. Specific error is: {Err}",
      "translation": "Connexion impossible à l'API REST Horizon pour exécuter {ApiMethod}. Il se peut que le tunnel SSH associé à ce port soit inactif, à moins que ce ne soit l'agent Horizon distant à l'autre bout du tunnel. Erreur spécifique : {Err}"
    },
    {
      "id": "{ApiMsg} new request failed: {Err}",
      "translation": "{ApiMsg} - Echec de nouvelle demande : {Err}"
    },
    {
      "id": "HTTP code: {HttpCode}",
      "translation": "Code HTTP : {HttpCode}"
    },
    {
      "id": "Bad HTTP code from {ApiMsg}: {HttpCode}",
      "translation": "Code HTTP incorrect à partir de {ApiMsg} : {HttpCode}"
    },
    {
      "id": "bad HTTP code from {ApiMsg}: {HttpCode}",
      "translation": "Code HTTP incorrect à partir de {ApiMsg} : {HttpCode}"
    },
    {
      "id": "Failed to read body response from {ApiMsg}: {Err}",
      "translation": "Echec de lecture de la réponse du corps à partir de {ApiMsg} : {Err}"
    },
    {
      "id": "failed to read body response from {ApiMsg}: {Err}",
      "translation": "Echec de lecture de la réponse du corps à partir de {ApiMsg} : {Err}"
    },
    {
      "id": "Failed to unmarshal body response from {ApiMsg}: {Err}",
      "translation": "Echec de désérialisation de la réponse du corps à partir de {ApiMsg} : {Err}"
    },
    {
      "id": "failed to unmarshal body response from {ApiMsg}: {Err}",
      "translation": "Echec de désérialisation de la réponse du corps à partir de {ApiMsg} : {Err}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}: {Body}",
      "translation": "Code HTTP incorrect {HttpCode} à partir de {ApiMsg} : {Body}"
    },
    {
      "id": "failed to marshal body for {ApiMsg}: {Err}",
      "translation": "Echec de sérialisation du corps pour {ApiMsg} : {Err}"
    },
    {
      "id": "HZN_AGBOT_URL is not defined",
      "translation": "HZN_AGBOT_URL n'est pas définie"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}, output: {StringbodyBytes}",
      "translation": "Code HTTP {HttpCode} incorrect de {ApiMsg}, sortie : {StringbodyBytes}"
    },
    {
      "id": "failed to unmarshal exchange body response from {ApiMsg}: {Err}",
      "translation": "Echec de désérialisation de la réponse du corps Exchange de {ApiMsg} : {Err}"
    },
    {
      "id": "failed to marshal exchange output from {ApiMsg}: {Err}",
      "translation": "Echec de sérialisation de la sortie Exchange de {ApiMsg} : {Err}"
    },
    {
      "id": "Failed to unmarshal bytes. {Err}",
      "translation": "Echec de désérialisation des octets. {Err}"
    },
    {
      "id": "Error getting {OldMgmtHubCertPath} from {ANAXOVERWRITEFILE}: {Err}",
      "translation": "Erreur d'obtention de {OldMgmtHubCertPath} depuis {ANAXOVERWRITEFILE} : {Err}"
    },
    {
      "id": "Encountered error reading ICP cert file {IcpCertPath}: {Err}",
      "translation": "Erreur rencontrée lors de la lecture du fichier de certificat ICP {IcpCertPath} : {Err}"
    },
    {
      "id": "Error getting HZN_EXCHANGE_URL from {ANAXOVERWRITEFILE}. {Err}",
      "translation": "Erreur lors de l'obtention de HZN_EXCHANGE_URL à partir de {ANAXOVERWRITEFILE}. {Err}"
    },
    {
      "id": "Error getting ExchangeUrl from {ANAXCONFIGFILE}. {Err}",
      "translation": "Erreur lors de l'obtention de ExchangeUrl à partir de {ANAXCONFIGFILE}. {Err}"
    },
    {
      "id": "HZN_EXCHANGE_URL is not set, get it from horizon agent configuration on the node.",
      "translation": "La variable HZN_EXCHANGE_URL n'est pas définie. Récupérez-la à partir de la configuration de l'agent Horizon sur le noeud."
    },
    {
      "id": "Could not get the Exchange url from environment variable HZN_EXCHANGE_URL or the horizon agent",
      "translation": "Impossible d'obtenir l'URL Exchange à partir de la variable d'environnement HZN_EXCHANGE_URL ou de l'agent Horizon."
    },
    {
      "id": "The exchange url: {ExchUrl}",
      "translation": "URL Exchange : {ExchUrl}"
    },
    {
      "id": "Error getting HZN_FSS_CSSURL from {ANAXOVERWRITEFILE}. {Err}",
      "translation": "Erreur lors de l'obtention de HZN_FSS_CSSURL à partir de {ANAXOVERWRITEFILE}. {Err}"
    },
    {
      "id": "Error getting model management service Url from {ANAXCONFIGFILE}. {Err}",
      "translation": "Erreur lors de l'obtention de l'URL du service de gestion des modèles à partir de {ANAXCONFIGFILE}. {Err}"
    },
    {
      "id": "HZN_FSS_CSSURL is not set, get it from horizon agent configuration on the node.",
      "translation": "La variable HZN_FSS_CSSURL n'est pas définie. Récupérez-la à partir de la configuration de l'agent Horizon sur le noeud."
    },
    {
      "id": "Could not get the model management service url from environment variable HZN_FSS_CSSURL or the horizon agent",
      "translation": "Impossible d'obtenir l'adresse URL du service de gestion des modèles à partir de la variable d'environnement HZN_FSS_CSSURL ou de l'agent Horizon."
    },
    {
      "id": "The model management service url: {MmsUrl}",
      "translation": "URL du service de gestion des modèles : {MmsUrl}"
    },
    {
      "id": "HZN_SDO_SVC_URL is not set, get it from {ANAXOVERWRITEFILE}.",
      "translation": "La variable HZN_SDO_SVC_URL n'est pas définie. Récupérez-la à partir de {ANAXOVERWRITEFILE}."
    },
    {
      "id": "Error getting HZN_SDO_SVC_URL from {ANAXOVERWRITEFILE}: {Err}",
      "translation": "Erreur lors de l'obtention de HZN_SDO_SVC_URL à partir de {ANAXOVERWRITEFILE} : {Err}"
    },
    {
      "id": "Could not get the HZN_SDO_SVC_URL value from the environment, {ANAXOVERWRITEFILE}, or one of the hzn.json files",
      "translation": "Impossible d'obtenir la valeur HZN_SDO_SVC_URL depuis l'environnement, {ANAXOVERWRITEFILE}, ou l'un des fichiers hzn.json."
    },
    {
      "id": "The SDO service url: {SdoUrl}",
      "translation": "URL du service SDO : {SdoUrl}"
    },
    {
      "id": "Can't connect to the Horizon {HorizonService} REST API to run {ApiMethod}. Set {ServiceEnvVarName} to use {Article} {HorizonService_1} other than the one the Horizon Agent is currently configured for. Specific error is: {Err}",
      "translation": "Connexion impossible à l'API REST Horizon {HorizonService} pour exécuter {ApiMethod}. Définissez {ServiceEnvVarName} afin d'utiliser un {Article} {HorizonService_1} autre que celui pour lequel l'agent Horizon est actuellement configuré. Erreur spécifique : {Err}"
    },
    {
      "id": "Can't connect to the Horizon {HorizonService} REST API to run {ApiMethod}. Maybe {ServiceEnvVarName} is set incorrectly? Or unset {ServiceEnvVarName_1} to use the {HorizonService_1} that the Horizon Agent is configured for. Specific error is: {Err}",
      "translation": "Connexion impossible à l'API REST Horizon {HorizonService} pour exécuter {ApiMethod}. {ServiceEnvVarName} a peut-être été défini de manière incorrecte. Vous pouvez également annuler la configuration de {ServiceEnvVarName_1} afin d'utiliser le service {HorizonService_1} pour lequel est configuré l'agent Horizon. Erreur spécifique : {Err}"
    },
    {
      "id": "failed to marshal exchange body for {ApiMsg}: {Err}",
      "translation": "Echec de sérialisation du corps Exchange pour {ApiMsg} : {Err}"
    },
    {
      "id": "Failed to get file info: {Err}",
      "translation": "Impossible d'obtenir les informations sur le fichier : {Err}"
    },
    {
      "id": "Malformed URL: {UrlPath}. {ErrUrl}",
      "translation": "URL incorrectement formée : {UrlPath}. {ErrUrl}"
    },
    {
      "id": "Uploading: {Float32totalSent__float32bodyLen__100} {}",
      "translation": "Téléchargement en cours : {Float32totalSent__float32bodyLen__100} {}"
    },
    {
      "id": "unable to open object file {Name}: {Err}",
      "translation": "impossible d'ouvrir le fichier objet {Name} : {Err}"
    },
    {
      "id": "Encountered HTTP error: {Err} calling {Service} REST API {ApiMsg}. HTTP status: {Httpstatus}. Will retry.",
      "translation": "Une erreur HTTP {Err} s'est produite lors de l'appel de l'API REST {ApiMsg} du service {Service}. Statut HTTP : {Httpstatus}. Une nouvelle tentative sera effectuée."
    },
    {
      "id": "Encountered HTTP error: {Err} calling {Service} REST API {ApiMsg}. HTTP status: {Httpstatus}.",
      "translation": "Une erreur HTTP {Err} s'est produite lors de l'appel de l'API REST {ApiMsg} du service {Service}. Statut HTTP : {Httpstatus}."
    },
    {
      "id": "failed to read exchange body response from {ApiMsg}: {Err}",
      "translation": "Echec de lecture de la réponse du corps Exchange de {ApiMsg} : {Err}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}: {Code}, {Msg}",
      "translation": "Code HTTP {HttpCode} incorrect de {ApiMsg} : {Code}, {Msg}"
    },
    {
      "id": "bad HTTP code {HttpCode} from {ApiMsg}",
      "translation": "Code HTTP {HttpCode} incorrect de {ApiMsg}"
    },
    {
      "id": "exchange authentication must be specified with one of the following: the -u flag, the -n flag, HZN_EXCHANGE_USER_AUTH or HZN_EXCHANGE_NODE_AUTH",
      "translation": "L'authentification Exchange doit être spécifiée avec l'une des valeurs suivantes : indicateur -u ou -n, variable HZN_EXCHANGE_USER_AUTH ou HZN_EXCHANGE_NODE_AUTH"
    },
    {
      "id": "Verifying public key file ...",
      "translation": "Vérification du fichier de clé publique..."
    },
    {
      "id": "provided public key is not valid; error: {Err}",
      "translation": "La clé publique fournie n'est pas valide. Erreur : {Err}"
    },
    {
      "id": "Checking private key file format ...",
      "translation": "Vérification du format de fichier de clé privée..."
    },
    {
      "id": "provided private key is not valid; error: {Err}",
      "translation": "La clé privée fournie n'est pas valide. Erreur : {Err}"
    },
    {
      "id": "{Err}. Please create the signing key.",
      "translation": "{Err}. Veuillez créer la clé de signature."
    },
    {
      "id": "running: {CmdStr}",
      "translation": "en cours d'exécution : {CmdStr}"
    },
    {
      "id": "did not get a command object",
      "translation": "Aucun objet de commande renvoyé"
    },
    {
      "id": "Could not get Stdin pipe, error: {Err}",
      "translation": "Impossible d'obtenir le pipe Stdin, erreur : {Err}"
    },
    {
      "id": "could not retrieve output from command, error: {Err}",
      "translation": "Impossible de récupérer la sortie de la commande, erreur : {Err}"
    },
    {
      "id": "could not retrieve stderr from command, error: {Err}",
      "translation": "Impossible de récupérer stderr de la commande, erreur : {Err}"
    },
    {
      "id": "Unable to start command, error: {Err}",
      "translation": "Impossible de lancer la commande, erreur : {Err}"
    },
    {
      "id": "Unable to write to stdin of command, error: {Err}",
      "translation": "Impossible d'écrire dans l'entrée standard (stdin) de la commande, erreur : {Err}"
    },
    {
      "id": "Unable to close stdin, error: {Err}",
      "translation": "Impossible de fermer stdin, erreur : {Err}"
    },
    {
      "id": "could not read stdout, error: {Err}",
      "translation": "Impossible de lire la sortie standard (stdout), erreur : {Err}"
    },
    {
      "id": "could not read stderr, error: {Err}",
      "translation": "Impossible de lire l'erreur standard (stderr), erreur : {Err}"
    },
    {
      "id": "command failed: {Err}, stderr: {StringstderrBytes}",
      "translation": "Echec de commande : {Err}, stderr : {StringstderrBytes}"
    },
    {
      "id": "Unable to use {HTTPRequestTimeoutOverride} to set the request timeout, the value is not a valid number: {EnvTimeout}",
      "translation": "Impossible d'utiliser {HTTPRequestTimeoutOverride} pour définir le délai d'attente de demande, la valeur n'est pas un nombre valide : {EnvTimeout}"
    },
    {
      "id": "HTTP request timeout set to {RequestTimeout} seconds",
      "translation": "Délai d'attente de demande HTTP défini sur {RequestTimeout} secondes"
    },
    {
      "id": "Error converting environmental variable HZN_HTTP_RETRIES {MaxRetriess} to integer. {Err1}",
      "translation": "Erreur lors de la conversion de la variable d'environnement HZN_HTTP_RETRIES {MaxRetriess} en entier. {Err1}"
    },
    {
      "id": "Error converting environmental variable HZN_HTTP_RETRY_INTERVAL {RetryIntervals} to integer. {Err1}",
      "translation": "Erreur lors de la conversion de la variable d'environnement HZN_HTTP_RETRY_INTERVAL {RetryIntervals} en entier. {Err1}"
    },
    {
      "id": "{Image} parsed into: domain={Domain}, path={Path}, tag={Tag}",
      "translation": "{Image} analysée en : domaine={Domain}, chemin={Path}, balise={Tag}"
    },
    {
      "id": "Warning: could not parse image path '{Image}'. Not pushing it to a docker registry, just including it in the 'deployment' field as-is.",
      "translation": "Avertissement : Impossible d'analyser le chemin de l'image '{Image}'. Celle-ci n'est pas envoyée (push) vers un registre Docker, mais juste incluse telle quelle dans la zone 'deployment'."
    },
    {
      "id": "Docker pull failure: {Err}",
      "translation": "Echec de l'extraction Docker : {Err}"
    },
    {
      "id": "Provided log-driver ({LogDriver}) does not support logs viewing. Logs are only available on the following drivers: {DockerDriversWithLoggingSupport}",
      "translation": "Le pilote de journal fourni ({LogDriver}) ne prend pas en charge l'affichage des journaux. Les journaux sont disponibles uniquement sur les pilotes suivants : {DockerDriversWithLoggingSupport}"
    },
    {
      "id": "Error creating StdoutPipe for command: {Err}",
      "translation": "Erreur lors de la création de StdoutPipe pour la commande : {Err}"
    },
    {
      "id": "Error starting command: {Err}",
      "translation": "Erreur lors du démarrage de la commande : {Err}"
    },
    {
      "id": "Error waiting for command: {Err}",
      "translation": "Erreur lors de l'attente de la commande : {Err}"
    },
    {
      "id": "{SysLogPath} could not be opened or does not exist: {Err}",
      "translation": "{SysLogPath} n'a pas pu être ouvert ou n'existe pas : {Err}"
    },
    {
      "id": "{SysLogPath} could not get stats: {Err}",
      "translation": "{SysLogPath} n'a pas pu obtenir les statistiques : {Err}"
    },
    {
      "id": "Error reading from {SysLogPath}: {Err}",
      "translation": "Erreur de lecture depuis {SysLogPath} : {Err}"
    },
    {
      "id": "Unable to state {SysLogPath}: {Err}",
      "translation": "Impossible d'obtenir l'état de {SysLogPath} : {Err}"
    },
    {
      "id": "no service name",
      "translation": "Aucun nom de service"
    },
    {
      "id": "no docker image for service {ServiceName}",
      "translation": "Aucune image Docker pour le service {ServiceName}"
    },
    {
      "id": "failed to marshal body for {D}: {Err}",
      "translation": "Echec de sérialisation du corps de texte pour {D} : {Err}"
    },
    {
      "id": "failed to unmarshal json for deployment field {StringjsonBytes}: {Err}",
      "translation": "Echec de désérialisation json pour la zone de déploiement {StringjsonBytes} : {Err}"
    },
    {
      "id": "user input {Name} has no default value and is not set",
      "translation": "L'entrée utilisateur {Name} n'a pas de valeur par défaut et n'est pas définie"
    },
    {
      "id": "'requiredServices' is not supported for cluster type service.",
      "translation": "'requiredServices' n'est pas pris en charge pour le service de type cluster."
    },
    {
      "id": "Failed to convert version {Ver} for service {ReqSvc} to version range expression.",
      "translation": "Impossible de convertir la version {Ver} de service {ReqSvc} en une expression de plage de versions."
    },
    {
      "id": "Error retrieving service from the Exchange for {ReqSvc}. {Err}",
      "translation": "Erreur lors de la récupération du service à partir d'Exchange pour {ReqSvc}. {Err}"
    },
    {
      "id": "The required service {SId} has the wrong service type: {SType}.",
      "translation": "Le service requis {SId} possède le mauvais type de service : {SType}."
    },
    {
      "id": "The dependent service {Id} for the required service {SId} has the wrong service type: {SType1}.",
      "translation": "Le service dépendant {Id} du service requis {SId} possède le mauvais type de service : {SType1}."
    },
    {
      "id": "failed to unmarshal json input {JsonBytes}: {Err}",
      "translation": "Echec de désérialisation de l'entrée json {JsonBytes} : {Err}"
    },
    {
      "id": "Error getting new user input format. {Err1}",
      "translation": "Erreur lors de l'obtention du nouveau format d'entrée utilisateur. {Err1}"
    },
    {
      "id": "Failed to create json object for user input. {Err1}",
      "translation": "Echec de création de l'objet json pour l'entrée utilisateur. {Err1}"
    },
    {
      "id": "Deployment policy and pattern are mutually exclusive.",
      "translation": "La règle de déploiement et le pattern s'excluent mutuellement."
    },
    {
      "id": "Neither deployment policy nor pattern is specified.",
      "translation": "Aucune règle de déploiement ni aucun pattern n'est spécifié(e)."
    },
    {
      "id": "Incompatible",
      "translation": "Incompatible"
    },
    {
      "id": "Compatible",
      "translation": "Compatible"
    },
    {
      "id": "The given node id is empty.",
      "translation": "L'ID noeud indiqué est vide."
    },
    {
      "id": "Organization is not specified in the given node id: {NodeId}.",
      "translation": "L'organisation n'est pas spécifiée dans l'ID noeud fourni : {NodeId}."
    },
    {
      "id": "Error getting node {NodeId} from the Exchange. {Err}",
      "translation": "Erreur lors de l'obtention du noeud {NodeId} à partir d'Exchange. {Err}"
    },
    {
      "id": "No node found for this node id {NodeId}.",
      "translation": "Aucun noeud trouvé pour cet ID noeud {NodeId}."
    },
    {
      "id": "Error unmarshaling deployment string to internal deployment structure: {Err}",
      "translation": "Erreur lors de la désérialisation de la chaîne de déploiement dans la structure de déploiement interne : {Err}"
    },
    {
      "id": "Invalid node type: {NodeType}. It must be 'device' or 'cluster'.",
      "translation": "Type de noeud non valide : {NodeType}. Le type doit être 'device' ou 'cluster'."
    },
    {
      "id": "The input node type '{NodeType}' does not match the node type '{ExchNodeType}' from the node {NodeId}.",
      "translation": "Le type de noeud d'entrée '{NodeType}' ne correspond pas au type de noeud '{ExchNodeType}' dans le noeud {NodeId}."
    },
    {
      "id": "Service does not have deployment configuration for node type 'device'.",
      "translation": "Le service ne dispose pas de configuration de déploiement pour le type de noeud 'device'."
    },
    {
      "id": "Service does not have cluster deployment configuration for node type 'cluster'.",
      "translation": "Le service ne dispose pas de configuration de déploiement de cluster pour le type de noeud 'cluster'."
    },
    {
      "id": "Unable to create version expression from {VersionRange}. {Err}",
      "translation": "Impossible de créer une expression de version à partir de la plage de versions {VersionRange}. {Err}"
    },
    {
      "id": "Error retrieving dependent services from the Exchange for {SDep}. {Err}",
      "translation": "Erreur lors de la récupération des services dépendants depuis Exchange pour {SDep}. {Err}"
    },
    {
      "id": "Failed to find definition for dependent services of {TopId}. Compatability of {PROPNODEPRIVILEGED} cannot be fully evaluated until all services are in the Exchange.",
      "translation": "Echec de la recherche de définition pour des services dépendants de {TopId}. La compatibilité de {PROPNODEPRIVILEGED} ne peut pas être complètement évaluée tant que tous les services ne sont pas dans Exchange."
    },
    {
      "id": "The PolicyCheck input cannot be null",
      "translation": "L'entrée PolicyCheck ne peut pas être NULL"
    },
    {
      "id": "The input node architecture {NodeArch} does not match the Exchange node architecture {Arch} for node {NodeId}.",
      "translation": "L'architecture de noeud d'entrée {NodeArch} ne correspond pas à celle du noeud d'Exchange {Arch} pour le noeud {NodeId}."
    },
    {
      "id": "Policy Incompatible",
      "translation": "Règle incompatible"
    },
    {
      "id": "Architecture does not match.",
      "translation": "L'architecture ne correspond pas."
    },
    {
      "id": "Failed to get services for all archetctures for {Org}/{WorkloadURL} version {Version}. {Err}",
      "translation": "Echec d'obtention des services pour toutes les architectures de {Org}/{WorkloadURL} version {Version}. {Err}"
    },
    {
      "id": "Failed to validate the service policy. {Err}",
      "translation": "Echec de validation de la règle de service. {Err}"
    },
    {
      "id": "Service with 'arch' {NodeArch} cannot be found in the deployment policy.",
      "translation": "Le service associé à 'arch' {NodeArch} est introuvable dans la règle de déploiement."
    },
    {
      "id": "No services found in the deployment policy.",
      "translation": "Aucun service trouvé dans la règle de déploiement."
    },
    {
      "id": "Node policy cannot be null.",
      "translation": "La règle de noeud ne peut pas être NULL."
    },
    {
      "id": "Deployment policy cannot be null.",
      "translation": "La règle de déploiement ne peut pas être NULL."
    },
    {
      "id": "Merged service policy cannot be null.",
      "translation": "La règle de service fusionnée ne peut pas être NULL."
    },
    {
      "id": "Error merging node policy with arch property. {Err}",
      "translation": "Erreur lors de la fusion de la règle de noeud avec la propriété arch. {Err}"
    },
    {
      "id": "Failed to validate the node policy. {Err}",
      "translation": "Echec de validation de la règle de noeud. {Err}"
    },
    {
      "id": "Failed to convert node policy to internal policy format for node {NodeId}: {Err}",
      "translation": "Echec de conversion du format de règle de noeud en format de règle interne pour le noeud {NodeId} : {Err}"
    },
    {
      "id": "No node policy found for this node {NodeId}.",
      "translation": "Aucune règle de noeud trouvée pour cet ID noeud {NodeId}."
    },
    {
      "id": "Neither node policy nor node id is specified.",
      "translation": "Aucune règle de noeud ni aucun ID noeud n'est spécifié."
    },
    {
      "id": "Node id is empty.",
      "translation": "L'ID noeud est vide."
    },
    {
      "id": "Organization is not specified in the node id: {NodeId}.",
      "translation": "L'organisation n'est pas spécifiée dans l'ID noeud : {NodeId}."
    },
    {
      "id": "Error trying to query node policy for {NodeId}: {Err}",
      "translation": "Erreur lors de la tentative d'interrogation de la règle de noeud pour {NodeId} : {Err}"
    },
    {
      "id": "Failed to validate the node policy for node {NodeId}. {Err}",
      "translation": "Echec de validation de la règle de noeud pour le noeud {NodeId}. {Err}"
    },
    {
      "id": "Failed to convert node policy to internal policy for node {NodeId}: {Err}",
      "translation": "Echec de conversion de la règle de noeud en règle interne pour le noeud {NodeId} : {Err}"
    },
    {
      "id": "Failed to convert deployment policy {BpId} to internal policy: {Err1}",
      "translation": "Echec de conversion de la règle de déploiement {BpId} en règle interne : {Err1}"
    },
    {
      "id": "Validation failure for deployment policy {BpId}. {Err}",
      "translation": "Echec de validation pour la règle de déploiement {BpId}. {Err}"
    },
    {
      "id": "No services specified in the given deployment policy {BpId}.",
      "translation": "Aucun service spécifié dans la règle de déploiement donnée {BpId}."
    },
    {
      "id": "No services specified in the deployment policy {Name}.",
      "translation": "Aucun service spécifié dans la règle de déploiement {Name}."
    },
    {
      "id": "Neither deployment policy nor deployment policy id is specified.",
      "translation": "Aucune règle de déploiement ni aucun ID de règle de déploiement n'est spécifié(e)."
    },
    {
      "id": "Deployment policy id is empty.",
      "translation": "L'ID de règle de déploiement est vide."
    },
    {
      "id": "Organization is not specified in the deployment policy id: {BpId}.",
      "translation": "L'organisation n'est pas spécifiée dans l'ID de règle de déploiement : {BpId}."
    },
    {
      "id": "Unable to get deployment policy for {BpId}, {Err}",
      "translation": "Impossible d'obtenir la règle de déploiement pour {BpId}, {Err}"
    },
    {
      "id": "No deployment policy found for this id {BpId}.",
      "translation": "Aucune règle de déploiement trouvée pour cet ID {BpId}."
    },
    {
      "id": "Failed to convert deployment policy {BpId} to internal policy format: {Err}",
      "translation": "Echec de conversion de la règle de déploiement {BpId} au format de règle interne : {Err}"
    },
    {
      "id": "Service policy id is empty.",
      "translation": "L'ID règle de service est vide."
    },
    {
      "id": "Organization is not specified in the service policy id: {SvcId}.",
      "translation": "L'organisation n'est pas spécifiée dans l'ID règle de service : {SvcId}."
    },
    {
      "id": "Error trying to query service policy for service id {SvcId}: {Err}",
      "translation": "Erreur lors de la tentative d'interrogation de la règle de service pour l'ID service {SvcId} : {Err}"
    },
    {
      "id": "Error validating the service policy {SvcId}. {Err}",
      "translation": "Erreur lors de la validation de la règle de service {SvcId}. {Err}"
    },
    {
      "id": "Service name is empty.",
      "translation": "Le nom de service est vide."
    },
    {
      "id": "Service organization is empty.",
      "translation": "L'organisation du service est vide."
    },
    {
      "id": "Error trying to query service policy for {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}",
      "translation": "Erreur lors de la tentative d'interrogation de la règle de service pour {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}"
    },
    {
      "id": "Failed to validate the service policy for {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}",
      "translation": "Echec de validation de la règle de service pour {SvcOrg}/{SvcUrl} {SvcVersion} {SvcArch}. {Err}"
    },
    {
      "id": "The given deployment policy should not be null.",
      "translation": "La règle de déploiement donnée ne doit pas être NULL."
    },
    {
      "id": "Error merging deployment policy with service policy. {Err}",
      "translation": "Erreur lors de la fusion de la règle de déploiement avec la règle de service. {Err}"
    },
    {
      "id": "Unable to find service definition from the input services.",
      "translation": "Impossible de trouver la définition de service à partir des services d'entrée."
    },
    {
      "id": "The SecretBindingCheck input cannot be null",
      "translation": "L'entrée SecretBindingCheck ne peut pas avoir pour valeur NULL"
    },
    {
      "id": "Node type '{NodeType}' does not support secret binding check.",
      "translation": "Le type de noeud '{NodeType}' ne prend pas en charge la vérification de liaison de secret."
    },
    {
      "id": "No service versions with architecture {NodeArch} specified in the deployment policy or pattern.",
      "translation": "Aucune version de service avec l'architecture {NodeArch} n'est spécifiée dans la règle de déploiement ou le pattern."
    },
    {
      "id": "No service versions specified in the deployment policy or pattern.",
      "translation": "Aucune version de service n'est spécifiée dans la règle de déploiement ou le pattern."
    },
    {
      "id": "Secret Binding Incompatible",
      "translation": "Liaison de secret incompatible"
    },
    {
      "id": "Type Incompatible",
      "translation": "Type incompatible"
    },
    {
      "id": "Error getting services for all archetctures for {ServiceOrg}/{ServiceURL} version {Version}. {Err}",
      "translation": "Erreur lors de l'obtention des services pour toutes les architectures de {ServiceOrg}/{ServiceURL} version {Version}. {Err}"
    },
    {
      "id": "Service definition not found in the input.",
      "translation": "Définition de service introuvable dans l'entrée."
    },
    {
      "id": "Warning: The following secret bindings are not required by any services: {ExtraneousSB}",
      "translation": "Avertissement : les liaisons de secret suivantes ne sont requises par aucun service : {ExtraneousSB}"
    },
    {
      "id": "Service with 'arch' {NodeArch} cannot be found in the deployment policy or pattern.",
      "translation": "Le service associé à 'arch' {NodeArch} est introuvable dans la règle de déploiement ou le pattern."
    },
    {
      "id": "No services found in the deployment policy or pattern.",
      "translation": "Aucun service trouvé dans la règle de déploiement ou le pattern."
    },
    {
      "id": "The input service definition object cannot be null.",
      "translation": "L'objet de définition du service d'entrée ne doit pas être NULL."
    },
    {
      "id": "Error verifying secret in the secret manager. {Err}",
      "translation": "Erreur lors de la vérification du secret dans le gestionnaire de secrets. {Err}"
    },
    {
      "id": "The input service spec object cannot be null.",
      "translation": "L'objet de spécification du service d'entrée ne doit pas être NULL."
    },
    {
      "id": "Failed to find the dependent services for {Org}/{URL} {Arch} {Version}. {Err}",
      "translation": "Les services dépendants sont introuvables pour {Org}/{URL} {Arch} {Version}. {Err}"
    },
    {
      "id": "Secret binding for a cluster service is not supported.",
      "translation": "La liaison de secret pour un service de cluster n'est pas prise en charge."
    },
    {
      "id": "No secret binding found for the following service secrets: {NbArray}.",
      "translation": "Aucune liaison de secret n'a été trouvée pour les secrets de service suivants : {NbArray}."
    },
    {
      "id": "Wrong version string {ServiceVersionRange} specified in secret binding for service {SvcOrg}/{SvcName} {SvcVersion} {SvcArch}, error {Err}",
      "translation": "Chaîne de version incorrecte, {ServiceVersionRange}, spécifiée dans la liaison de secret pour le service {SvcOrg}/{SvcName} {SvcVersion} {SvcArch}, erreur {Err}"
    },
    {
      "id": "Error checking version {SvcVersion} in range {VExp}. {Err}",
      "translation": "Erreur lors de la vérification de la version {SvcVersion} dans la plage {VExp}. {Err}"
    },
    {
      "id": "agbot URL cannot be an empty string when checking secret binding. Please make sure HZN_AGBOT_URL is set.",
      "translation": "L'URL agbot ne peut pas être une chaîne vide lors de la vérification de la liaison de secret. Vérifiez que HZN_AGBOT_URL est défini."
    },
    {
      "id": "The node organization must be provided.",
      "translation": "L'organisation du noeud doit être fournie."
    },
    {
      "id": "Error parsing secret name in the secret binding. {Errparse}",
      "translation": "Erreur lors de l'analyse syntaxique du nom de secret dans la liaison de secret. {Errparse}"
    },
    {
      "id": "Error checking secret {VaultSecretName} in the secret manager. {Err}",
      "translation": "Erreur lors de la vérification du secret {VaultSecretName} dans le gestionnaire de secrets. {Err}"
    },
    {
      "id": "The binding secret name cannot be an empty string. The valid formats are: '<secretname>' for the organization level secret and 'user/<username>/<secretname>' for the user level secret.",
      "translation": "Le nom du secret de liaison ne peut pas être une chaîne vide. Les formats valides sont les suivants : '<secretname>'pour le secret de niveau organisation et 'user/<username>/<secretname>' pour le secret de niveau utilisateur."
    },
    {
      "id": "Invalid format for the binding secret name: {SecretName}. The valid formats are: '<secretname>' for the organization level secret and 'user/<username>/<secretname>' for the user level secret.",
      "translation": "Format non valide pour le nom de secret de liaison : {SecretName}. Les formats valides sont les suivants : '<secretname>'pour le secret de niveau organisation et 'user/<username>/<secretname>' pour le secret de niveau utilisateur."
    },
    {
      "id": "The UserInputCheck input cannot be null",
      "translation": "L'entrée UserInputCheck ne peut pas être NULL"
    },
    {
      "id": "Neither node user input nor node id is specified.",
      "translation": "Aucune entrée utilisateur de noeud ni aucun ID noeud n'est spécifié."
    },
    {
      "id": "User Input Incompatible",
      "translation": "Entrée utilisateur incompatible"
    },
    {
      "id": "Warning: checking node user input:  {Err}",
      "translation": "Avertissement : vérification de l'entrée utilisateur de noeud :  {Err}"
    },
    {
      "id": "Warning: checking user input for the deployment policy: {Err}",
      "translation": "Avertissement : vérification de l'entrée utilisateur pour la règle de déploiement : {Err}"
    },
    {
      "id": "Warning: checking user input for the pattern: {Err}",
      "translation": "Avertissement : vérification de l'entrée utilisateur pour le pattern : {Err}"
    },
    {
      "id": "Error verifing user input for service {SId}. {Err}",
      "translation": "Erreur lors de la validation de l'entrée utilisateur pour le service {SId}. {Err}"
    },
    {
      "id": "Failed to verify user input for service {SId}. {Reason}",
      "translation": "Echec de vérification de l'entrée utilisateur pour le service {SId}. {Reason}"
    },
    {
      "id": "Error verifing user input for dependent service {Id}. {Err}",
      "translation": "Erreur lors de la vérification de l'entrée utilisateur pour le service dépendant {Id}. {Err}"
    },
    {
      "id": "Failed to verify user input for dependent service {Id}. {Reason}",
      "translation": "Echec de vérification de l'entrée utilisateur pour le service dépendant {Id}. {Reason}"
    },
    {
      "id": "Failed to get the service from the Exchange. {Err}",
      "translation": "Echec d'obtention du service depuis Exchange. {Err}"
    },
    {
      "id": "Service does not exist on the Exchange.",
      "translation": "Le service n'existe pas dans Exchange."
    },
    {
      "id": "No user input found for service.",
      "translation": "Aucune entrée utilisateur trouvée pour le service."
    },
    {
      "id": "Failed to validate the user input type for variable {Name}. {Err}",
      "translation": "Echec de validation du type d'entrée utilisateur pour la variable {Name}. {Err}"
    },
    {
      "id": "A required user input value is missing for variable {Name}.",
      "translation": "Une valeur d'entrée utilisateur obligatoire est manquante pour la variable {Name}."
    },
    {
      "id": "{Errmsg} Service {Org}/{URL} version {Version} arch {Arch} is missing in the node user input.",
      "translation": "{Errmsg} Le service {Org}/{URL} version {Version} arch {Arch} est manquant dans l'entrée utilisateur de noeud."
    },
    {
      "id": "Service URL {URL} does not match the service URL {Name} specified in the deployment policy.",
      "translation": "L'URL de service {URL} ne correspond pas à l'URL de service {Name} spécifiée dans la règle de déploiement."
    },
    {
      "id": "Service Org {Org} does not match the service org {Org_1} specified in the deployment policy.",
      "translation": "L'organisation de service {Org} ne correspond pas à l'organisation de service {Org_1} spécifiée dans la règle de déploiement."
    },
    {
      "id": "Service architecure {Arch} does not match the service architectrure {Arch_1} specified in the deployment policy.",
      "translation": "L'architecture de service {Arch} ne correspond pas à l'architecture de service {Arch_1} spécifiée dans la règle de déploiement."
    },
    {
      "id": "Service version {Version} does not match any service versions specified in the deployment policy.",
      "translation": "La version de service {Version} ne correspond à aucune version de service spécifiée dans la règle de déploiement."
    },
    {
      "id": "The service does not match any services in the pattern.",
      "translation": "Le service ne correspond à aucun service du pattern."
    },
    {
      "id": "Pattern {PatId} cannot be found on the Exchange.",
      "translation": "Le pattern {PatId} est introuvable sur Exchange."
    },
    {
      "id": "Neither pattern nor pattern id is specified.",
      "translation": "Aucun pattern ni aucun ID de pattern n'est spécifié."
    },
    {
      "id": "Pattern id is empty.",
      "translation": "L'ID de pattern est vide."
    },
    {
      "id": "Organization is not specified in the pattern id: {PatId}.",
      "translation": "L'organisation n'est pas spécifiée dans l'ID de pattern : {PatId}."
    },
    {
      "id": "Error getting pattern {PatId} from the Exchange, {Err}",
      "translation": "Erreur lors de l'obtention du pattern {PatId} depuis Exchange, {Err}"
    },
    {
      "id": "No pattern found for this id {PatId}.",
      "translation": "Aucun pattern trouvé pour cet ID {PatId}."
    },
    {
      "id": "URL must be specified in the service definition.",
      "translation": "L'URL doit être spécifiée dans la définition de service."
    },
    {
      "id": "Version must be specified in the service definition for service {URL}.",
      "translation": "La version doit être spécifiée dans la définition de service associée au service {URL}."
    },
    {
      "id": "Invalid version format {Version} for service {URL}.",
      "translation": "Format de version non valide {Version} pour le service {URL}."
    },
    {
      "id": "Arch must be specified in the service definition for service {URL}.",
      "translation": "L'architecture doit être spécifiée dans la définition de service associée au service {URL}."
    },
    {
      "id": "Org must be specified in the service definition for service {URL}.",
      "translation": "L'organisation doit être spécifiée dans la définition de service associée au service {URL}."
    },
    {
      "id": "Validation failure for input service {SId}. {Err}",
      "translation": "Echec de validation pour le service d'entrée {SId}. {Err}"
    },
    {
      "id": "The service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not referenced by the pattern or deployment policy. Please make sure the serviceOrgid, serviceUrl, serviceArch and serviceVersionRange are correct.",
      "translation": "Le service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} spécifié dans l'entrée utilisateur n'est pas référencé par le pattern ou la règle de déploiement. Assurez-vous que les valeurs serviceOrgid, serviceUrl, serviceArch et serviceVersionRange sont correctes."
    },
    {
      "id": "The service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not referenced by the pattern or deployment policy. Please make sure the service specification is correct.",
      "translation": "Le service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} spécifié dans l'entrée utilisateur n'est pas référencé par le pattern ou la règle de déploiement. Assurez-vous que la spécification de service est correcte."
    },
    {
      "id": "Variable {Name} for service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} specified in the user input is not used. Please make sure it is a correct name.",
      "translation": "La variable {Name} associée au service {ServiceOrgid}/{ServiceUrl} version {ServiceVersionRange} arch {ServiceArch} spécifiée dans l'entrée utilisateur n'est pas utilisée. Assurez-vous que le nom est correct."
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported capability for a workload",
      "translation": "La configuration du déploiement {Arg_1} contient une fonctionnalité de charge de travail non prise en charge."
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported capability for infrastructure container.",
      "translation": "La configuration du déploiement {Arg_1} contient une fonctionnalité de conteneur d'infrastructure non prise en charge."
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported bind for a workload, {Arg_2}",
      "translation": "La configuration du déploiement {Arg_1} contient une liaison non prise en charge pour la charge de travail, {Arg_2}"
    },
    {
      "id": "Deployment config {Arg_1} contains unsupported bind for {Arg_2}, {Arg_3}",
      "translation": "La configuration du déploiement {Arg_1} contient une liaison non prise en charge pour {Arg_2}, {Arg_3}"
    },
    {
      "id": "Error Unmarshalling deployment string {Arg_1}, error: {Arg_2}",
      "translation": "Erreur lors de la désérialisation de la chaîne de déploiement {Arg_1}. Erreur : {Arg_2}"
    },
    {
      "id": "Error Unmarshalling deployment override string {Arg_1} for agreement {Arg_2}, error: {Arg_3}",
      "translation": "Erreur lors de la désérialisation de la chaîne de remplacement {Arg_1} pour l'accord {Arg_2}. Erreur : {Arg_3}"
    },
    {
      "id": "Error starting containers: {Arg_1}",
      "translation": "Erreur lors du démarrage des conteneurs : {Arg_1}"
    },
    {
      "id": "Error starting containers for agreement {Arg_1}: {Arg_2}",
      "translation": "Erreur lors du démarrage des conteneurs pour l'accord {Arg_1} : {Arg_2}"
    },
    {
      "id": "Error restarting containers for agreements {Arg_1}: {Arg_2}",
      "translation": "Erreur lors du redémarrage des conteneurs pour les accords {Arg_1} : {Arg_2}"
    },
    {
      "id": "Error cleaning up old containers before starting up new containers for {Arg_1}. Error: {Arg_2}",
      "translation": "Erreur lors du nettoyage des anciens conteneurs avant de démarrer les nouveaux conteneurs pour {Arg_1}. Erreur : {Arg_2}"
    },
    {
      "id": "Failed to get a list of parent containers for service retry for {Arg_1}. {Arg_2}",
      "translation": "Impossible d'obtenir la liste des conteneurs parents pour une nouvelle tentative de service pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Failed to restoring the network connection with the parents for service {Arg_1}. {Arg_2}",
      "translation": "Impossible de restaurer la connexion réseau avec les parents pour le service {Arg_1}. {Arg_2}"
    },
    {
      "id": "anax terminating. Unable to access service storage direcotry specified in config: {Arg_1}. {Arg_2}",
      "translation": "Anax est en cours d'arrêt. Impossible d'accéder au répertoire de stockage de service spécifié dans config : {Arg_1}. {Arg_2}"
    },
    {
      "id": "anax terminating. Failed to instantiate iptables client. {Arg_1}",
      "translation": "Anax est en cours d'arrêt. Echec d'instanciation du client iptables. {Arg_1}"
    },
    {
      "id": "anax terminating. Failed to instantiate docker client. {Arg_1}",
      "translation": "Anax est en cours d'arrêt. Echec d'instanciation du client docker. {Arg_1}"
    },
    {
      "id": "Property {PROPNODEPRIVILEGED} must have a boolean value (true or false).",
      "translation": "La propriété {PROPNODEPRIVILEGED} doit avoir une valeur booléenne (true ou false)."
    },
    {
      "id": "Property must include a name and a value: {Property}",
      "translation": "La propriété doit inclure un nom et une valeur : {Property}"
    },
    {
      "id": "Property {Name} has invalid property type {DeclaredType}. Allowed property types are: version, string, int, boolean, float, and list of strings.",
      "translation": "La propriété {Name} comporte un type de propriété non valide {DeclaredType}. Les types de propriété autorisés sont : version, string (chaîne), int(entier), boolean (booléen), float (flottant) et list of strings (liste de chaînes)."
    },
    {
      "id": "Property value is of type {ActualType}, expected type {DeclaredType}",
      "translation": "La valeur de la propriété est de type {ActualType}, alors que le type attendu est {DeclaredType}"
    },
    {
      "id": "Value {Value} of property {Name} is not an integer type",
      "translation": "La valeur {Value} de la propriété {Name} n'est pas un type entier."
    },
    {
      "id": "Value {Value} of property {Name} is not a valid string. Please define type or change value to a string.",
      "translation": "La valeur {Value} de la propriété {Name} n'est pas une chaîne valide. Veuillez définir le type ou modifier la valeur en chaîne."
    },
    {
      "id": "Property {Name} with value {Value} is not a valid verion string",
      "translation": "La propriété {Name} avec la valeur {Value} n'est pas une chaîne de version valide."
    },
    {
      "id": "Property {Name} has invalid value type {ActualType}",
      "translation": "La propriété {Name} possède un type de valeur {ActualType} non valide."
    },
    {
      "id": "The constraint expression: {Dconstraints} is type {Dconstraints_1}, but is expected to be an array of strings",
      "translation": "L'expression de contrainte {Dconstraints} est de type {Dconstraints_1}, alors qu'elle devrait être un tableau de chaînes"
    },
    {
      "id": "The constraint expression contains unmatched parentheses.",
      "translation": "L'expression de contrainte comporte des parenthèses sans correspondance."
    },
    {
      "id": "Error retrieving agreement {Arg_1} from database, error {Arg_2}",
      "translation": "Erreur lors de la récupération de l'accord {Arg_1} à partir de la base de données. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for MeteringNotification message, error {Arg_2}",
      "translation": "Impossible de récupérer l'accord {Arg_1} à partir de la base de données pour le message MeteringNotification. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for Cancel message, error {Arg_2}",
      "translation": "Impossible de récupérer l'accord {Arg_1} à partir de la base de données pour le message Cancel. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for ReplyAck message, error {Arg_2}",
      "translation": "Impossible de récupérer l'accord {Arg_1} à partir de la base de données pour le message ReplyAck. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve agreement {Arg_1} from database for DataReceived message, error {Arg_2}",
      "translation": "Impossible de récupérer l'accord {Arg_1} à partir de la base de données pour le message DataReceived. Erreur {Arg_2}"
    },
    {
      "id": "Unable to retrieve unarchived agreements from database. {Arg_1}",
      "translation": "Impossible de récupérer les accords non archivés à partir de la base de données. {Arg_1}"
    },
    {
      "id": "Error marking agreement {Arg_1} terminated in database: {Arg_2}.",
      "translation": "Erreur lors du marquage de l'accord {Arg_1} comme étant terminé dans la base de données {Arg_2}."
    },
    {
      "id": "Error getting service definitions {Arg_1} from db. {Arg_2}",
      "translation": "Erreur lors de l'obtention des définitions de service {Arg_1} à partir de la base de données. {Arg_2}"
    },
    {
      "id": "Error retrieving all service definitions from db. {Arg_1}",
      "translation": "Erreur lors de l'extraction de toutes les définitions de service de la base de données. {Arg_1}"
    },
    {
      "id": "Error retrieving all service instances from database for {Arg_1}/{Arg_2} version {Arg_3} key {Arg_4}. {Arg_5}",
      "translation": "Erreur lors de la récupération de toutes les instances de service à partir de la base de données pour {Arg_1}/{Arg_2} version {Arg_3} clé {Arg_4}. {Arg_5}"
    },
    {
      "id": "Error retrieving all service instances from database for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors de la récupération de toutes les instances de service à partir de la base de données pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error retrieving all service instances from database, error: {Arg_1}",
      "translation": "Erreur lors de la récupération de toutes les instances de service à partir de la base de données. Erreur {Arg_1}"
    },
    {
      "id": "Error getting service instance {Arg_1} from db. {Arg_2}",
      "translation": "Erreur lors de l'obtention de l'instance de service {Arg_1} à partir de la base de données. {Arg_2}"
    },
    {
      "id": "Error retrieving matching agreements from database for workloads {Arg_1}. Error: {Arg_2}",
      "translation": "Erreur lors de la récupération des accords correspondants à partir de la base de données pour les charges de travail {Arg_1}. Erreur : {Arg_2}"
    },
    {
      "id": "Error perisisting node config state in database to {Arg_1}. Error: {Arg_2}",
      "translation": "Erreur de persistance de l'état de configuration de noeud dans la base de données sur {Arg_1}. Erreur : {Arg_2}"
    },
    {
      "id": "Error retrieving device from database. Error: {Arg_1}",
      "translation": "Erreur lors de la récupération du dispositif depuis la base de données. Erreur : {Arg_1}"
    },
    {
      "id": "Error deleting node exchange pattern from the local database. {Arg_1}",
      "translation": "Erreur lors de la suppression du pattern Exchange depuis la base de données locale. {Arg_1}"
    },
    {
      "id": "Error retrieving node {Arg_1} from the Exchange: {Arg_2}",
      "translation": "Erreur lors de la récupération du noeud {Arg_1} à partir d'Exchange : {Arg_2}"
    },
    {
      "id": "Error updating registeredServices for node {Arg_1} in the Exchange: {Arg_2}",
      "translation": "Erreur lors de la mise à jour de registeredServices pour le noeud {Arg_1} dans Exchange : {Arg_2}"
    },
    {
      "id": "Image loaded for {Arg_1}/{Arg_2}.",
      "translation": "Image chargée pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Image loaded for service {Arg_1}/{Arg_2}.",
      "translation": "Image chargée pour le service {Arg_1}/{Arg_2}."
    },
    {
      "id": "Error loading image for {Arg_1}/{Arg_2}. Reason: {Arg_3}",
      "translation": "Erreur lors du chargement de l'image pour {Arg_1}/{Arg_2}. Motif : {Arg_3}"
    },
    {
      "id": "Error loading image for service {Arg_1}/{Arg_2}.",
      "translation": "Erreur lors du chargement de l'image pour le service {Arg_1}/{Arg_2}."
    },
    {
      "id": "Start terminating agreement for {Arg_1}. Termination reason: {Arg_2}",
      "translation": "Démarrage de la résiliation de l'accord pour {Arg_1}. Motif de résiliation : {Arg_2}"
    },
    {
      "id": "Agreement reached for service {Arg_1}. The agreement id is {Arg_2}.",
      "translation": "Accord trouvé pour le service {Arg_1}. ID accord : {Arg_2}."
    },
    {
      "id": "Agreement for {Arg_1} no longer valid on the agbot. Node will cancel it.",
      "translation": "L'accord pour {Arg_1} n'est plus valide sur l'agbot. Le noeud l'annulera."
    },
    {
      "id": "Workload service containers for {Arg_1}/{Arg_2} are up and running.",
      "translation": "Les conteneurs de service de charge de travail pour {Arg_1}/{Arg_2} sont opérationnels."
    },
    {
      "id": "Complete terminating agreement for {Arg_1}. Termination reason: {Arg_2}",
      "translation": "Fin de la résiliation de l'accord pour {Arg_1}. Motif de résiliation : {Arg_2}"
    },
    {
      "id": "Error deleting agreement for {Arg_1} in exchange: {Arg_2}. Will retry.",
      "translation": "Erreur lors de la suppression de l'accord pour {Arg_1} dans Exchange : {Arg_2}. Une nouvelle tentative sera effectuée."
    },
    {
      "id": "Encountered error for AgreementVerification for {Arg_1} with agbot, error {Arg_2}",
      "translation": "Une erreur s'est produite lors de la vérification de l'accord pour {Arg_1} avec l'agbot. Erreur {Arg_2}"
    },
    {
      "id": "ReplyAck indicated that the agbot did not want to pursue the agreement for {Arg_1}. Node will cancel the agreement",
      "translation": "ReplyAck a indiqué que l'agbot n'a pas voulu poursuivre l'accord pour {Arg_1}. Le noeud annulera l'accord."
    },
    {
      "id": "Node received Cancel message for {Arg_1}/{Arg_2} from agbot {Arg_3}.",
      "translation": "Le noeud a reçu un message Cancel pour {Arg_1}/{Arg_2} depuis l'agbot {Arg_3}."
    },
    {
      "id": "Error handling ReplyAck message for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors du traitement du message ReplyAck pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling ReplyAck message. {Arg_1}",
      "translation": "Erreur lors du traitement du message ReplyAck. {Arg_1}"
    },
    {
      "id": "Error handling DataReceived message for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors du traitement du message DataReceived pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling DataReceived message. {Arg_1}",
      "translation": "Erreur lors du traitement du message DataReceived. {Arg_1}"
    },
    {
      "id": "Error handling MeterNotification message for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors du traitement du message MeterNotification pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling MeterNotification message. {Arg_1}",
      "translation": "Erreur lors du traitement du message MeterNotification. {Arg_1}"
    },
    {
      "id": "Error handling Cancel message for {Arg_1}. {Arg_2}",
      "translation": "Erreur lors du traitement du message Cancel pour {Arg_1}. {Arg_2}"
    },
    {
      "id": "Error handling Cancel message. {Arg_1}",
      "translation": "Erreur lors du traitement du message Cancel. {Arg_1}"
    },
    {
      "id": "Start workload service for {Arg_1}/{Arg_2}.",
      "translation": "Démarrage du service de charge de travail pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Workload destroyed for {Arg_1}",
      "translation": "Charge de travail supprimée pour {Arg_1}"
    },
    {
      "id": "Service containers for {Arg_1} started.",
      "translation": "Les conteneurs de service pour {Arg_1} ont démarré."
    },
    {
      "id": "Complete cleaning up the service instance {Arg_1}.",
      "translation": "Fin du nettoyage de l'instance de service {Arg_1}."
    },
    {
      "id": "Start dependent services for {Arg_1}/{Arg_2}.",
      "translation": "Démarrage des services dépendants pour {Arg_1}/{Arg_2}."
    },
    {
      "id": "Encountered error starting dependen services for {Arg_1}/{Arg_2}. {Arg_3}",
      "translation": "Une erreur s'est produite lors du démarrage des services dépendants pour {Arg_1}/{Arg_2}. {Arg_3}"
    },
    {
      "id": "Error starting dependen service {Arg_1}/{Arg_2} version {Arg_3} for agreement {Arg_4}. {Arg_5}",
      "translation": "Erreur lors du démarrage du service dépendant {Arg_1}/{Arg_2} version {Arg_3} pour l'accord {Arg_4}. {Arg_5}"
    },
    {
      "id": "Start cleaning up service {Arg_1} because agreement {Arg_2} ended.",
      "translation": "Démarrage du nettoyage du service {Arg_1}, car l'accord {Arg_2} a pris fin."
    },
    {
      "id": "Error starting service {Arg_1}/{Arg_2} version {Arg_3}, error: {Arg_4}",
      "translation": "Erreur lors du démarrage du service {Arg_1}/{Arg_2} version {Arg_3}. Erreur : {Arg_4}"
    },
    {
      "id": "Error getting all the services from agreements: {Arg_1}",
      "translation": "Erreur lors de l'obtention de tous les services à partir des accords {Arg_1}"
    },
    {
      "id": "Start agreement-less service {Arg_1}/{Arg_2}.",
      "translation": "Démarrage du service sans accord {Arg_1}/{Arg_2}."
    },
    {
      "id": "Complete starting agreement-less service {Arg_1}/{Arg_2} and its dependents.",
      "translation": "Fin du démarrage du service sans accord {Arg_1}/{Arg_2} et de ses éléments dépendants."
    },
    {
      "id": "Unable to start agreement-less service {Arg_1}/{Arg_2}, error {Arg_3}",
      "translation": "Impossible de démarrer le service sans accord {Arg_1}/{Arg_2}. Erreur {Arg_3}"
    },
    {
      "id": "Unable to start agreement-less services, error searching for pattern {Arg_1} in exchange, error: {Arg_2}",
      "translation": "Impossible de démarrer les services sans accord. Une erreur s'est produite lors de la recherche du pattern {Arg_1} dans Exchange. Erreur : {Arg_2}"
    },
    {
      "id": "Unable to start agreement-less services, pattern {Arg_1} not found in exchange",
      "translation": "Impossible de démarrer les services sans accord. Pattern {Arg_1} introuvable dans Exchange."
    },
    {
      "id": "Unable to start agreement-less service {Arg_1}/{Arg_2}, local service definition not found",
      "translation": "Impossible de démarrer le service sans accord {Arg_1}/{Arg_2}. La définition du service local est introuvable."
    },
    {
      "id": "Start upgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Démarrage de la mise à niveau du service {Arg_1}/{Arg_2} de la version {Arg_3} vers la version {Arg_4}."
    },
    {
      "id": "Complete upgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Fin de la mise à niveau du service {Arg_1}/{Arg_2} de la version {Arg_3} vers la version {Arg_4}."
    },
    {
      "id": "Failed to upgrade service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}, error: {Arg_5}",
      "translation": "Echec de mise à niveau du service {Arg_1}/{Arg_2} de la version {Arg_3} vers la version {Arg_4}. Erreur : {Arg_5}"
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because service for agreement failed to start.",
      "translation": "Démarrage de la rétromigration du service {Arg_1}/{Arg_2} version {Arg_3}, car le démarrage du service d'accord a échoué."
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because service failed to start.",
      "translation": "Démarrage de la rétromigration du service {Arg_1}/{Arg_2} version {Arg_3}, car le démarrage du service a échoué."
    },
    {
      "id": "Start downgrading service {Arg_1}/{Arg_2} version {Arg_3} because upgrading failed.",
      "translation": "Démarrage de la rétromigration du service {Arg_1}/{Arg_2} version {Arg_3} en raison de l'échec de la mise à niveau."
    },
    {
      "id": "Failed to downgrade service {Arg_1}/{Arg_2} version {Arg_3}, error: {Arg_4}",
      "translation": "Echec de rétromigration du service {Arg_1}/{Arg_2} version {Arg_3}. Erreur : {Arg_4}"
    },
    {
      "id": "Completed downgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}.",
      "translation": "Fin de la rétromigration du service {Arg_1}/{Arg_2} de la version {Arg_3} à la version {Arg_4}."
    },
    {
      "id": "Error finding the new service definition to downgrade to for {Arg_1}/{Arg_2} version {Arg_3} key {Arg_4}. error: {Arg_5}",
      "translation": "Erreur lors de la recherche de la nouvelle définition de service à rétromigrer pour {Arg_1}/{Arg_2} version {Arg_3} clé {Arg_4}. Erreur : {Arg_5}"
    },
    {
      "id": "Could not find lower version to downgrade for {Arg_1}/{Arg_2} version {Arg_3}.",
      "translation": "Impossible de trouver une version antérieure pour rétromigrer {Arg_1}/{Arg_2} version {Arg_3}."
    },
    {
      "id": "Error downgrading service {Arg_1}/{Arg_2} from version {Arg_3} to version {Arg_4}. Error: {Arg_5}",
      "translation": "Erreur lors de la rétromigration du service {Arg_1}/{Arg_2} de la version {Arg_3} vers la version {Arg_4}. Erreur : {Arg_5}"
    },
    {
      "id": "Error downgrading service {Arg_1}/{Arg_2} version {Arg_3}. {Arg_4}",
      "translation": "Erreur lors de la rétromigration du service {Arg_1}/{Arg_2} version {Arg_3}. {Arg_4}"
    },
    {
      "id": "Start retrying number {Arg_1} for dependent service {Arg_2} version {Arg_3} because service failed.",
      "translation": "Début du nouvel essai du numéro {Arg_1} pour le service dépendant {Arg_2} version {Arg_3} en raison de l'échec du service."
    },
    {
      "id": "Failed retrying number {Arg_1} for dependent service {Arg_2} version {Arg_3}.",
      "translation": "Echec de nouvelle tentative {Arg_1} pour le service dépendant {Arg_2} version {Arg_3}."
    },
    {
      "id": "Failed to get the service retry count for {Arg_1} version {Arg_2}. {Arg_3}",
      "translation": "Echec d'obtention du nombre de tentatives de service pour {Arg_1} version {Arg_2}. {Arg_3}"
    },
    {
      "id": "Error updating retry start state for service instance {Arg_1} in dadabase. {Arg_2}",
      "translation": "Erreur lors de la mise à jour du statut des tentatives pour l'instance de service {Arg_1} dans la base de données. {Arg_2}"
    },
    {
      "id": "Node pattern changed on the Exchange from {Arg_1} to {Arg_2}.",
      "translation": "Le pattern de noeud sur Exchange est passé de {Arg_1} à {Arg_2}."
    },
    {
      "id": "Encountered error while re-registering node with new pattern {Arg_1}. {Arg_2}",
      "translation": "Erreur rencontrée lors du réenregistrement du noeud avec le nouveau pattern {Arg_1}. {Arg_2}"
    },
    {
      "id": "Start re-registering node after pattern changed to {Arg_1}.",
      "translation": "Début du réenregistrement du noeud après que le pattern soit passé à {Arg_1}."
    },
    {
      "id": "Complete re-registering node after pattern changed to {Arg_1}.",
      "translation": "Fin du réenregistrement du noeud après que le pattern soit passé à {Arg_1}."
    },
    {
      "id": "Node pattern changed again on the Exchange. Will register the node with the new pattern: {Arg_1}",
      "translation": "Le pattern de noeud a changé de nouveau sur Exchange. Le noeud sera enregistré avec le nouveau pattern : {Arg_1}"
    },
    {
      "id": "Error validating new node pattern {Arg_1}: {Arg_2}",
      "translation": "Erreur lors de la validation du nouveau pattern de noeud {Arg_1} : {Arg_2}"
    },
    {
      "id": "The node will keep using the old pattern {Arg_1}",
      "translation": "Le noeud continuera d'utiliser l'ancien pattern {Arg_1}"
    },
    {
      "id": "New pattern {Arg_1} is verified. Will cancel agreements and re-register the node with the new pattern.",
      "translation": "Nouveau pattern {Arg_1} vérifié. Les accords seront annulés et le noeud réenregistré avec le nouveau pattern."
    },
    {
      "id": "Compatibility Error: Schema versions are not the same, Consumer policy: {Version}, Producer policy {Version_1}",
      "translation": "Erreur de compatibilité : Les versions de schéma ne sont pas identiques, Règle consommateur : {Version}, Règle fournisseur {Version_1}"
    },
    {
      "id": "Compatibility Error: Node properties {Properties} do not satisfy constraint requirements {Constraints}. Underlying error: {Err}",
      "translation": "Erreur de compatibilité : Les propriétés de noeud {Properties} ne satisfont pas les exigences de contrainte {Constraints}. Erreur sous-jacente : {Err}"
    },
    {
      "id": "Compatibility Error: Node properties do not satisfy constraint requirements. {Err}",
      "translation": "Erreur de compatibilité : Les propriétés de noeud ne satisfont pas les exigences de contrainte. {Err}"
    },
    {
      "id": "Compatibility Error: Properties {Properties} do not satisfy Node constraint  {Constraints}. Underlying error: {Err}",
      "translation": "Erreur de compatibilité : Les propriétés {Properties} ne satisfont pas la contrainte de noeud {Constraints}. Erreur sous-jacente : {Err}"
    },
    {
      "id": "Compatibility Error: Properties do not satisfy node constraint. {Err}",
      "translation": "Erreur de compatibilité : les propriétés ne satisfont pas la contrainte de noeud. {Err}"
    },
    {
      "id": "Compatibility Error: No common Agreement Protocols between {AgreementProtocols} and {AgreementProtocols_1}. Underlying error: {Err}",
      "translation": "Erreur de compatibilité : Aucun protocole d'accord commun entre {AgreementProtocols} et {AgreementProtocols_1}. Erreur sous-jacente : {Err}"
    },
    {
      "id": "Compatibility Error: Data verification must be compatible, producer has {DataVerify} and consumer has {DataVerify_1}.",
      "translation": "Erreur de compatibilité : La vérification des données doit être compatible, le fournisseur obtient {DataVerify} et le consommateur {DataVerify_1}."
    },
    {
      "id": "Agreement {Arg_1} already exists, ignoring proposal: {Arg_2}",
      "translation": "L'accord {Arg_1} existe déjà, la proposition est ignorée : {Arg_2}"
    },
    {
      "id": "received error demarshalling TsAndCs for agrement {Arg_1}, {Arg_2}",
      "translation": "Une erreur s'est produite lors de la désérialisation de TsAndCs pour l'accord {Arg_1}, {Arg_2}"
    },
    {
      "id": "Node received Proposal message using agreement {Arg_1} for service {Arg_2}/{Arg_3} from the agbot {Arg_4}.",
      "translation": "Le noeud a reçu un message de proposition à l'aide de l'accord {Arg_1} pour le service {Arg_2}/{Arg_3} à partir de l'agbot {Arg_4}."
    },
    {
      "id": "Node rejected the proposal for service {Arg_1}/{Arg_2}.",
      "translation": "Le noeud a rejeté la proposition pour le service {Arg_1}/{Arg_2}."
    },
    {
      "id": "Error handling proposal for service {Arg_1}/{Arg_2}. Error: {Arg_3}",
      "translation": "Erreur lors du traitement de la proposition pour le service {Arg_1}/{Arg_2}. Erreur : {Arg_3}"
    },
    {
      "id": "unable to make directory for self signed MMS API certificate, error {Err}",
      "translation": "Impossible de créer le répertoire pour le certificat d'API MMS autosigné. Erreur {Err}"
    },
    {
      "id": "unable to generate random number for MMS API certificate serial number, error {Err}",
      "translation": "Impossible de générer un numéro aléatoire pour le numéro de série du certificat d'API MMS. Erreur {Err}"
    },
    {
      "id": "unable to generate private key for MMS API certificate, error {Err}",
      "translation": "Impossible de générer la clé privée pour le certificat d'API MMS. Erreur {Err}"
    },
    {
      "id": "unable to create MMS API certificate, error {Err}",
      "translation": "Impossible de créer le certificat d'API MMS. Erreur {Err}"
    },
    {
      "id": "unable to write MMS API certificate to file {ServerCertificate}, error {Err}",
      "translation": "Impossible d'écrire le fichier du certificat d'API MMS dans le fichier {ServerCertificate}. Erreur {Err}"
    },
    {
      "id": "unable to encode MMS API certificate to file {ServerCertificate}, error {Err}",
      "translation": "Impossible de coder le certificat d'API MMS dans le fichier {ServerCertificate}. Erreur {Err}"
    },
    {
      "id": "unable to close MMS API certificate file {ServerCertificate}, error {Err}",
      "translation": "Impossible de fermer le fichier certificat d'API MMS {ServerCertificate}. Erreur {Err}"
    },
    {
      "id": "unable to write MMS API certificate private key to file {ServerKey}, error {Err}",
      "translation": "Impossible d'écrire la clé privée du certificat d'API MMS dans le fichier {ServerKey}. Erreur {Err}"
    },
    {
      "id": "unable to encode MMS API certificate private key to file {ServerKey}, error {Err}",
      "translation": "Impossible de coder la clé privée du certificat d'API MMS dans le fichier {ServerKey}. Erreur {Err}"
    },
    {
      "id": "unable to close MMS API certificate private key file {ServerKey}, error {Err}",
      "translation": "Impossible de fermer le fichier de la clé privée du certificat d'API MMS {ServerKey}. Erreur {Err}"
    },
    {
      "id": "Unable to authenticate nil request for secrets API",
      "translation": "Impossible d'authentifier la demande nulle pour l'API de secrets"
    },
    {
      "id": "Unable to extract basic auth for request",
      "translation": "Impossible d'extraire l'authentification de base pour la demande"
    },
    {
      "id": "unable to verify {AppKey}, error {Err}",
      "translation": "impossible de vérifier {AppKey}, erreur {Err}"
    },
    {
      "id": "credentials for {AppKey} are not valid",
      "translation": "les données d'identification pour {AppKey} ne sont pas valides"
    },
    {
      "id": "Version_Expression: Empty string is not a valid version.",
      "translation": "Version_Expression : Une chaîne vide n'est pas une version valide."
    },
    {
      "id": "Version_Expression: Whitespace is not permitted in {Expr}.",
      "translation": "Version_Expression : Les espaces blancs ne sont pas autorisés dans {Expr}."
    },
    {
      "id": "Version_Expression: {Verstring} is not a valid version string.",
      "translation": "Version_Expression : {Verstring} n'est pas une chaîne de version valide."
    },
    {
      "id": "Version_Expression: {Verstring} does not begin with an inclusion or exclusion directive.",
      "translation": "Version_Expression : {Verstring} ne commence pas par une directive d'inclusion ou d'exclusion."
    },
    {
      "id": "Version_Expression: {Verstring} does not end with an inclusion or exclusion directive.",
      "translation": "Version_Expression : {Verstring} ne se termine pas par une directive d'inclusion ou d'exclusion."
    },
    {
      "id": "Version_Expression: Incorrect number of versions in expression: {Expr}.",
      "translation": "Version_Expression : Nombre incorrect de versions dans l'expression : {Expr}."
    },
    {
      "id": "Input version string {V1} or {V2} is not a valid single version string.",
      "translation": "La chaîne de version d'entrée {V1} ou {V2} n'est pas une chaîne de version unique valide."
    }
  ]
}
